{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, basic_auth\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "neo4jUser = os.getenv(\"NEO4J_USER\")\n",
    "neo4jPwd = os.getenv(\"NEO4J_PASSWORD_DS\")\n",
    "neo4jUrl = os.getenv(\"NEO4j_BOLT_DS\")\n",
    "\n",
    "driver = GraphDatabase.driver(neo4jUrl,auth=basic_auth(neo4jUser, neo4jPwd))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create the graph projection\n",
    "\n",
    "Create a projection of analyses connected with brain region and cell type, per specie\n",
    "\n",
    "For simplicity, we first add a special named relationship between the analyzes and brain region, cell type and specie.\n",
    "This relationship is cleaned up after the algorithm is complete."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(:RegionRecord)-->(b:BrainRegion)\n",
    "        MERGE (n)-[:SIMILARITY_ALGORITHM]->(b)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(c:CellType)\n",
    "        MERGE (n)-[:SIMILARITY_ALGORITHM]->(c)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Specimen)-->(s:Specie)\n",
    "        MERGE (n)-[:SIMILARITY_ALGORITHM]->(s)\n",
    "    \"\"\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"\"\"\n",
    "        CALL gds.graph.create.cypher(\n",
    "            'analyses-rat',\n",
    "            'MATCH (n:Analysis)-[:SIMILARITY_ALGORITHM]->(m) WHERE (n)-->(:Specie {id: \"1\"}) WITH collect(n)+collect(m) as nodes UNWIND nodes as x RETURN id(x) as id',\n",
    "            'MATCH (n:Analysis)-[:SIMILARITY_ALGORITHM]->(m) WHERE (n)-->(:Specie {id: \"1\"}) RETURN id(n) AS source, id(m) AS target'\n",
    "        )\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        CALL gds.graph.create.cypher(\n",
    "            'analyses-mouse',\n",
    "            'MATCH (n:Analysis)-[:SIMILARITY_ALGORITHM]->(m) WHERE (n)-->(:Specie {id: \"2\"}) WITH collect(n)+collect(m) as nodes UNWIND nodes as x RETURN id(x) as id',\n",
    "            'MATCH (n:Analysis)-[:SIMILARITY_ALGORITHM]->(m) WHERE (n)-->(:Specie {id: \"2\"}) RETURN id(n) AS source, id(m) AS target'\n",
    "        )\n",
    "    \"\"\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record id1='65' id2='57' similarity=1.0>\n",
      "<Record id1='65' id2='70' similarity=1.0>\n",
      "<Record id1='65' id2='64' similarity=1.0>\n",
      "<Record id1='65' id2='58' similarity=1.0>\n",
      "<Record id1='65' id2='66' similarity=1.0>\n",
      "<Record id1='65' id2='69' similarity=1.0>\n",
      "<Record id1='69' id2='57' similarity=1.0>\n",
      "<Record id1='69' id2='70' similarity=1.0>\n",
      "<Record id1='69' id2='64' similarity=1.0>\n",
      "<Record id1='69' id2='58' similarity=1.0>\n",
      "<Record id1='69' id2='66' similarity=1.0>\n",
      "<Record id1='69' id2='65' similarity=1.0>\n",
      "<Record id1='66' id2='57' similarity=1.0>\n",
      "<Record id1='66' id2='70' similarity=1.0>\n",
      "<Record id1='66' id2='64' similarity=1.0>\n",
      "<Record id1='66' id2='58' similarity=1.0>\n",
      "<Record id1='66' id2='69' similarity=1.0>\n",
      "<Record id1='66' id2='65' similarity=1.0>\n",
      "<Record id1='57' id2='66' similarity=1.0>\n",
      "<Record id1='57' id2='70' similarity=1.0>\n",
      "<Record id1='57' id2='64' similarity=1.0>\n",
      "<Record id1='57' id2='58' similarity=1.0>\n",
      "<Record id1='57' id2='69' similarity=1.0>\n",
      "<Record id1='57' id2='65' similarity=1.0>\n",
      "<Record id1='58' id2='66' similarity=1.0>\n",
      "<Record id1='58' id2='70' similarity=1.0>\n",
      "<Record id1='58' id2='64' similarity=1.0>\n",
      "<Record id1='58' id2='57' similarity=1.0>\n",
      "<Record id1='58' id2='69' similarity=1.0>\n",
      "<Record id1='58' id2='65' similarity=1.0>\n",
      "<Record id1='70' id2='66' similarity=1.0>\n",
      "<Record id1='70' id2='58' similarity=1.0>\n",
      "<Record id1='70' id2='64' similarity=1.0>\n",
      "<Record id1='70' id2='57' similarity=1.0>\n",
      "<Record id1='70' id2='69' similarity=1.0>\n",
      "<Record id1='70' id2='65' similarity=1.0>\n",
      "<Record id1='64' id2='66' similarity=1.0>\n",
      "<Record id1='64' id2='58' similarity=1.0>\n",
      "<Record id1='64' id2='70' similarity=1.0>\n",
      "<Record id1='64' id2='57' similarity=1.0>\n",
      "<Record id1='64' id2='69' similarity=1.0>\n",
      "<Record id1='64' id2='65' similarity=1.0>\n",
      "<Record id1='59' id2='67' similarity=1.0>\n",
      "<Record id1='59' id2='68' similarity=1.0>\n",
      "<Record id1='68' id2='67' similarity=1.0>\n",
      "<Record id1='68' id2='59' similarity=1.0>\n",
      "<Record id1='67' id2='68' similarity=1.0>\n",
      "<Record id1='67' id2='59' similarity=1.0>\n",
      "<Record id1='60' id2='654' similarity=1.0>\n",
      "<Record id1='60' id2='71' similarity=1.0>\n",
      "<Record id1='60' id2='671' similarity=1.0>\n",
      "<Record id1='60' id2='72' similarity=1.0>\n",
      "<Record id1='60' id2='73' similarity=1.0>\n",
      "<Record id1='60' id2='63' similarity=1.0>\n",
      "<Record id1='63' id2='654' similarity=1.0>\n",
      "<Record id1='63' id2='71' similarity=1.0>\n",
      "<Record id1='63' id2='671' similarity=1.0>\n",
      "<Record id1='63' id2='72' similarity=1.0>\n",
      "<Record id1='63' id2='73' similarity=1.0>\n",
      "<Record id1='63' id2='60' similarity=1.0>\n",
      "<Record id1='73' id2='654' similarity=1.0>\n",
      "<Record id1='73' id2='71' similarity=1.0>\n",
      "<Record id1='73' id2='671' similarity=1.0>\n",
      "<Record id1='73' id2='72' similarity=1.0>\n",
      "<Record id1='73' id2='63' similarity=1.0>\n",
      "<Record id1='73' id2='60' similarity=1.0>\n",
      "<Record id1='654' id2='73' similarity=1.0>\n",
      "<Record id1='654' id2='71' similarity=1.0>\n",
      "<Record id1='654' id2='671' similarity=1.0>\n",
      "<Record id1='654' id2='72' similarity=1.0>\n",
      "<Record id1='654' id2='63' similarity=1.0>\n",
      "<Record id1='654' id2='60' similarity=1.0>\n",
      "<Record id1='72' id2='73' similarity=1.0>\n",
      "<Record id1='72' id2='71' similarity=1.0>\n",
      "<Record id1='72' id2='671' similarity=1.0>\n",
      "<Record id1='72' id2='654' similarity=1.0>\n",
      "<Record id1='72' id2='63' similarity=1.0>\n",
      "<Record id1='72' id2='60' similarity=1.0>\n",
      "<Record id1='71' id2='73' similarity=1.0>\n",
      "<Record id1='71' id2='72' similarity=1.0>\n",
      "<Record id1='71' id2='671' similarity=1.0>\n",
      "<Record id1='71' id2='654' similarity=1.0>\n",
      "<Record id1='71' id2='63' similarity=1.0>\n",
      "<Record id1='71' id2='60' similarity=1.0>\n",
      "<Record id1='671' id2='73' similarity=1.0>\n",
      "<Record id1='671' id2='72' similarity=1.0>\n",
      "<Record id1='671' id2='71' similarity=1.0>\n",
      "<Record id1='671' id2='654' similarity=1.0>\n",
      "<Record id1='671' id2='63' similarity=1.0>\n",
      "<Record id1='671' id2='60' similarity=1.0>\n",
      "<Record id1='655' id2='74' similarity=1.0>\n",
      "<Record id1='655' id2='76' similarity=1.0>\n",
      "<Record id1='655' id2='62' similarity=1.0>\n",
      "<Record id1='655' id2='629' similarity=1.0>\n",
      "<Record id1='655' id2='61' similarity=1.0>\n",
      "<Record id1='655' id2='75' similarity=1.0>\n",
      "<Record id1='209' id2='207' similarity=1.0>\n",
      "<Record id1='209' id2='205' similarity=1.0>\n",
      "<Record id1='75' id2='74' similarity=1.0>\n",
      "<Record id1='75' id2='76' similarity=1.0>\n",
      "<Record id1='75' id2='62' similarity=1.0>\n",
      "<Record id1='75' id2='629' similarity=1.0>\n",
      "<Record id1='75' id2='61' similarity=1.0>\n",
      "<Record id1='75' id2='655' similarity=1.0>\n",
      "<Record id1='61' id2='74' similarity=1.0>\n",
      "<Record id1='61' id2='76' similarity=1.0>\n",
      "<Record id1='61' id2='62' similarity=1.0>\n",
      "<Record id1='61' id2='629' similarity=1.0>\n",
      "<Record id1='61' id2='75' similarity=1.0>\n",
      "<Record id1='61' id2='655' similarity=1.0>\n",
      "<Record id1='74' id2='61' similarity=1.0>\n",
      "<Record id1='74' id2='76' similarity=1.0>\n",
      "<Record id1='74' id2='62' similarity=1.0>\n",
      "<Record id1='74' id2='629' similarity=1.0>\n",
      "<Record id1='74' id2='75' similarity=1.0>\n",
      "<Record id1='74' id2='655' similarity=1.0>\n",
      "<Record id1='205' id2='207' similarity=1.0>\n",
      "<Record id1='205' id2='209' similarity=1.0>\n",
      "<Record id1='207' id2='205' similarity=1.0>\n",
      "<Record id1='207' id2='209' similarity=1.0>\n",
      "<Record id1='629' id2='61' similarity=1.0>\n",
      "<Record id1='629' id2='76' similarity=1.0>\n",
      "<Record id1='629' id2='62' similarity=1.0>\n",
      "<Record id1='629' id2='74' similarity=1.0>\n",
      "<Record id1='629' id2='75' similarity=1.0>\n",
      "<Record id1='629' id2='655' similarity=1.0>\n",
      "<Record id1='76' id2='61' similarity=1.0>\n",
      "<Record id1='76' id2='629' similarity=1.0>\n",
      "<Record id1='76' id2='62' similarity=1.0>\n",
      "<Record id1='76' id2='74' similarity=1.0>\n",
      "<Record id1='76' id2='75' similarity=1.0>\n",
      "<Record id1='76' id2='655' similarity=1.0>\n",
      "<Record id1='62' id2='61' similarity=1.0>\n",
      "<Record id1='62' id2='629' similarity=1.0>\n",
      "<Record id1='62' id2='76' similarity=1.0>\n",
      "<Record id1='62' id2='74' similarity=1.0>\n",
      "<Record id1='62' id2='75' similarity=1.0>\n",
      "<Record id1='62' id2='655' similarity=1.0>\n",
      "<Record id1='106' id2='133' similarity=1.0>\n",
      "<Record id1='106' id2='107' similarity=1.0>\n",
      "<Record id1='106' id2='323' similarity=1.0>\n",
      "<Record id1='106' id2='499' similarity=1.0>\n",
      "<Record id1='106' id2='105' similarity=1.0>\n",
      "<Record id1='106' id2='104' similarity=1.0>\n",
      "<Record id1='106' id2='745' similarity=1.0>\n",
      "<Record id1='106' id2='103' similarity=1.0>\n",
      "<Record id1='106' id2='225' similarity=1.0>\n",
      "<Record id1='106' id2='108' similarity=1.0>\n",
      "<Record id1='108' id2='133' similarity=1.0>\n",
      "<Record id1='108' id2='107' similarity=1.0>\n",
      "<Record id1='108' id2='323' similarity=1.0>\n",
      "<Record id1='108' id2='499' similarity=1.0>\n",
      "<Record id1='108' id2='105' similarity=1.0>\n",
      "<Record id1='108' id2='104' similarity=1.0>\n",
      "<Record id1='108' id2='745' similarity=1.0>\n",
      "<Record id1='108' id2='103' similarity=1.0>\n",
      "<Record id1='108' id2='225' similarity=1.0>\n",
      "<Record id1='108' id2='106' similarity=1.0>\n",
      "<Record id1='225' id2='133' similarity=1.0>\n",
      "<Record id1='225' id2='107' similarity=1.0>\n",
      "<Record id1='225' id2='323' similarity=1.0>\n",
      "<Record id1='225' id2='499' similarity=1.0>\n",
      "<Record id1='225' id2='105' similarity=1.0>\n",
      "<Record id1='225' id2='104' similarity=1.0>\n",
      "<Record id1='225' id2='745' similarity=1.0>\n",
      "<Record id1='225' id2='103' similarity=1.0>\n",
      "<Record id1='225' id2='108' similarity=1.0>\n",
      "<Record id1='225' id2='106' similarity=1.0>\n",
      "<Record id1='133' id2='225' similarity=1.0>\n",
      "<Record id1='133' id2='107' similarity=1.0>\n",
      "<Record id1='133' id2='323' similarity=1.0>\n",
      "<Record id1='133' id2='499' similarity=1.0>\n",
      "<Record id1='133' id2='105' similarity=1.0>\n",
      "<Record id1='133' id2='104' similarity=1.0>\n",
      "<Record id1='133' id2='745' similarity=1.0>\n",
      "<Record id1='133' id2='103' similarity=1.0>\n",
      "<Record id1='133' id2='108' similarity=1.0>\n",
      "<Record id1='133' id2='106' similarity=1.0>\n",
      "<Record id1='722' id2='266' similarity=1.0>\n",
      "<Record id1='722' id2='634' similarity=1.0>\n",
      "<Record id1='722' id2='561' similarity=1.0>\n",
      "<Record id1='722' id2='648' similarity=1.0>\n",
      "<Record id1='722' id2='568' similarity=1.0>\n",
      "<Record id1='722' id2='562' similarity=1.0>\n",
      "<Record id1='103' id2='225' similarity=1.0>\n",
      "<Record id1='103' id2='107' similarity=1.0>\n",
      "<Record id1='103' id2='323' similarity=1.0>\n",
      "<Record id1='103' id2='499' similarity=1.0>\n",
      "<Record id1='103' id2='105' similarity=1.0>\n",
      "<Record id1='103' id2='104' similarity=1.0>\n",
      "<Record id1='103' id2='745' similarity=1.0>\n",
      "<Record id1='103' id2='133' similarity=1.0>\n",
      "<Record id1='103' id2='108' similarity=1.0>\n",
      "<Record id1='103' id2='106' similarity=1.0>\n",
      "<Record id1='562' id2='266' similarity=1.0>\n",
      "<Record id1='562' id2='634' similarity=1.0>\n",
      "<Record id1='562' id2='561' similarity=1.0>\n",
      "<Record id1='562' id2='648' similarity=1.0>\n",
      "<Record id1='562' id2='568' similarity=1.0>\n",
      "<Record id1='562' id2='722' similarity=1.0>\n",
      "<Record id1='107' id2='225' similarity=1.0>\n",
      "<Record id1='107' id2='103' similarity=1.0>\n",
      "<Record id1='107' id2='323' similarity=1.0>\n",
      "<Record id1='107' id2='499' similarity=1.0>\n",
      "<Record id1='107' id2='105' similarity=1.0>\n",
      "<Record id1='107' id2='104' similarity=1.0>\n",
      "<Record id1='107' id2='745' similarity=1.0>\n",
      "<Record id1='107' id2='133' similarity=1.0>\n",
      "<Record id1='107' id2='108' similarity=1.0>\n",
      "<Record id1='107' id2='106' similarity=1.0>\n",
      "<Record id1='745' id2='225' similarity=1.0>\n",
      "<Record id1='745' id2='103' similarity=1.0>\n",
      "<Record id1='745' id2='323' similarity=1.0>\n",
      "<Record id1='745' id2='499' similarity=1.0>\n",
      "<Record id1='745' id2='105' similarity=1.0>\n",
      "<Record id1='745' id2='104' similarity=1.0>\n",
      "<Record id1='745' id2='107' similarity=1.0>\n",
      "<Record id1='745' id2='133' similarity=1.0>\n",
      "<Record id1='745' id2='108' similarity=1.0>\n",
      "<Record id1='745' id2='106' similarity=1.0>\n",
      "<Record id1='323' id2='225' similarity=1.0>\n",
      "<Record id1='323' id2='103' similarity=1.0>\n",
      "<Record id1='323' id2='745' similarity=1.0>\n",
      "<Record id1='323' id2='499' similarity=1.0>\n",
      "<Record id1='323' id2='105' similarity=1.0>\n",
      "<Record id1='323' id2='104' similarity=1.0>\n",
      "<Record id1='323' id2='107' similarity=1.0>\n",
      "<Record id1='323' id2='133' similarity=1.0>\n",
      "<Record id1='323' id2='108' similarity=1.0>\n",
      "<Record id1='323' id2='106' similarity=1.0>\n",
      "<Record id1='568' id2='266' similarity=1.0>\n",
      "<Record id1='568' id2='634' similarity=1.0>\n",
      "<Record id1='568' id2='561' similarity=1.0>\n",
      "<Record id1='568' id2='648' similarity=1.0>\n",
      "<Record id1='568' id2='562' similarity=1.0>\n",
      "<Record id1='568' id2='722' similarity=1.0>\n",
      "<Record id1='104' id2='225' similarity=1.0>\n",
      "<Record id1='104' id2='103' similarity=1.0>\n",
      "<Record id1='104' id2='745' similarity=1.0>\n",
      "<Record id1='104' id2='499' similarity=1.0>\n",
      "<Record id1='104' id2='105' similarity=1.0>\n",
      "<Record id1='104' id2='323' similarity=1.0>\n",
      "<Record id1='104' id2='107' similarity=1.0>\n",
      "<Record id1='104' id2='133' similarity=1.0>\n",
      "<Record id1='104' id2='108' similarity=1.0>\n",
      "<Record id1='104' id2='106' similarity=1.0>\n",
      "<Record id1='266' id2='568' similarity=1.0>\n",
      "<Record id1='266' id2='634' similarity=1.0>\n",
      "<Record id1='266' id2='561' similarity=1.0>\n",
      "<Record id1='266' id2='648' similarity=1.0>\n",
      "<Record id1='266' id2='562' similarity=1.0>\n",
      "<Record id1='266' id2='722' similarity=1.0>\n",
      "<Record id1='499' id2='225' similarity=1.0>\n",
      "<Record id1='499' id2='103' similarity=1.0>\n",
      "<Record id1='499' id2='745' similarity=1.0>\n",
      "<Record id1='499' id2='104' similarity=1.0>\n",
      "<Record id1='499' id2='105' similarity=1.0>\n",
      "<Record id1='499' id2='323' similarity=1.0>\n",
      "<Record id1='499' id2='107' similarity=1.0>\n",
      "<Record id1='499' id2='133' similarity=1.0>\n",
      "<Record id1='499' id2='108' similarity=1.0>\n",
      "<Record id1='499' id2='106' similarity=1.0>\n",
      "<Record id1='105' id2='225' similarity=1.0>\n",
      "<Record id1='105' id2='103' similarity=1.0>\n",
      "<Record id1='105' id2='745' similarity=1.0>\n",
      "<Record id1='105' id2='104' similarity=1.0>\n",
      "<Record id1='105' id2='499' similarity=1.0>\n",
      "<Record id1='105' id2='323' similarity=1.0>\n",
      "<Record id1='105' id2='107' similarity=1.0>\n",
      "<Record id1='105' id2='133' similarity=1.0>\n",
      "<Record id1='105' id2='108' similarity=1.0>\n",
      "<Record id1='105' id2='106' similarity=1.0>\n",
      "<Record id1='648' id2='568' similarity=1.0>\n",
      "<Record id1='648' id2='634' similarity=1.0>\n",
      "<Record id1='648' id2='561' similarity=1.0>\n",
      "<Record id1='648' id2='266' similarity=1.0>\n",
      "<Record id1='648' id2='562' similarity=1.0>\n",
      "<Record id1='648' id2='722' similarity=1.0>\n",
      "<Record id1='224' id2='225' similarity=1.0>\n",
      "<Record id1='224' id2='103' similarity=1.0>\n",
      "<Record id1='224' id2='745' similarity=1.0>\n",
      "<Record id1='224' id2='104' similarity=1.0>\n",
      "<Record id1='224' id2='499' similarity=1.0>\n",
      "<Record id1='224' id2='323' similarity=1.0>\n",
      "<Record id1='224' id2='107' similarity=1.0>\n",
      "<Record id1='224' id2='133' similarity=1.0>\n",
      "<Record id1='224' id2='108' similarity=1.0>\n",
      "<Record id1='224' id2='106' similarity=1.0>\n",
      "<Record id1='634' id2='568' similarity=1.0>\n",
      "<Record id1='634' id2='648' similarity=1.0>\n",
      "<Record id1='634' id2='561' similarity=1.0>\n",
      "<Record id1='634' id2='266' similarity=1.0>\n",
      "<Record id1='634' id2='562' similarity=1.0>\n",
      "<Record id1='634' id2='722' similarity=1.0>\n",
      "<Record id1='134' id2='225' similarity=1.0>\n",
      "<Record id1='134' id2='103' similarity=1.0>\n",
      "<Record id1='134' id2='745' similarity=1.0>\n",
      "<Record id1='134' id2='104' similarity=1.0>\n",
      "<Record id1='134' id2='499' similarity=1.0>\n",
      "<Record id1='134' id2='323' similarity=1.0>\n",
      "<Record id1='134' id2='107' similarity=1.0>\n",
      "<Record id1='134' id2='133' similarity=1.0>\n",
      "<Record id1='134' id2='108' similarity=1.0>\n",
      "<Record id1='134' id2='106' similarity=1.0>\n",
      "<Record id1='561' id2='568' similarity=1.0>\n",
      "<Record id1='561' id2='648' similarity=1.0>\n",
      "<Record id1='561' id2='634' similarity=1.0>\n",
      "<Record id1='561' id2='266' similarity=1.0>\n",
      "<Record id1='561' id2='562' similarity=1.0>\n",
      "<Record id1='561' id2='722' similarity=1.0>\n",
      "<Record id1='414' id2='475' similarity=1.0>\n",
      "<Record id1='414' id2='425' similarity=1.0>\n",
      "<Record id1='414' id2='324' similarity=1.0>\n",
      "<Record id1='414' id2='471' similarity=1.0>\n",
      "<Record id1='414' id2='493' similarity=1.0>\n",
      "<Record id1='414' id2='481' similarity=1.0>\n",
      "<Record id1='414' id2='377' similarity=1.0>\n",
      "<Record id1='414' id2='415' similarity=1.0>\n",
      "<Record id1='414' id2='346' similarity=1.0>\n",
      "<Record id1='414' id2='453' similarity=1.0>\n",
      "<Record id1='453' id2='475' similarity=1.0>\n",
      "<Record id1='453' id2='425' similarity=1.0>\n",
      "<Record id1='453' id2='324' similarity=1.0>\n",
      "<Record id1='453' id2='471' similarity=1.0>\n",
      "<Record id1='453' id2='493' similarity=1.0>\n",
      "<Record id1='453' id2='481' similarity=1.0>\n",
      "<Record id1='453' id2='377' similarity=1.0>\n",
      "<Record id1='453' id2='415' similarity=1.0>\n",
      "<Record id1='453' id2='346' similarity=1.0>\n",
      "<Record id1='453' id2='414' similarity=1.0>\n",
      "<Record id1='346' id2='475' similarity=1.0>\n",
      "<Record id1='346' id2='425' similarity=1.0>\n",
      "<Record id1='346' id2='324' similarity=1.0>\n",
      "<Record id1='346' id2='471' similarity=1.0>\n",
      "<Record id1='346' id2='493' similarity=1.0>\n",
      "<Record id1='346' id2='481' similarity=1.0>\n",
      "<Record id1='346' id2='377' similarity=1.0>\n",
      "<Record id1='346' id2='415' similarity=1.0>\n",
      "<Record id1='346' id2='453' similarity=1.0>\n",
      "<Record id1='346' id2='414' similarity=1.0>\n",
      "<Record id1='470' id2='278' similarity=1.0>\n",
      "<Record id1='470' id2='492' similarity=1.0>\n",
      "<Record id1='470' id2='391' similarity=1.0>\n",
      "<Record id1='470' id2='111' similarity=1.0>\n",
      "<Record id1='470' id2='186' similarity=1.0>\n",
      "<Record id1='470' id2='419' similarity=1.0>\n",
      "<Record id1='470' id2='277' similarity=1.0>\n",
      "<Record id1='470' id2='429' similarity=1.0>\n",
      "<Record id1='470' id2='430' similarity=1.0>\n",
      "<Record id1='470' id2='408' similarity=1.0>\n",
      "<Record id1='408' id2='278' similarity=1.0>\n",
      "<Record id1='408' id2='492' similarity=1.0>\n",
      "<Record id1='408' id2='391' similarity=1.0>\n",
      "<Record id1='408' id2='111' similarity=1.0>\n",
      "<Record id1='408' id2='186' similarity=1.0>\n",
      "<Record id1='408' id2='419' similarity=1.0>\n",
      "<Record id1='408' id2='277' similarity=1.0>\n",
      "<Record id1='408' id2='429' similarity=1.0>\n",
      "<Record id1='408' id2='430' similarity=1.0>\n",
      "<Record id1='408' id2='470' similarity=1.0>\n",
      "<Record id1='430' id2='278' similarity=1.0>\n",
      "<Record id1='430' id2='492' similarity=1.0>\n",
      "<Record id1='430' id2='391' similarity=1.0>\n",
      "<Record id1='430' id2='111' similarity=1.0>\n",
      "<Record id1='430' id2='186' similarity=1.0>\n",
      "<Record id1='430' id2='419' similarity=1.0>\n",
      "<Record id1='430' id2='277' similarity=1.0>\n",
      "<Record id1='430' id2='429' similarity=1.0>\n",
      "<Record id1='430' id2='408' similarity=1.0>\n",
      "<Record id1='430' id2='470' similarity=1.0>\n",
      "<Record id1='475' id2='346' similarity=1.0>\n",
      "<Record id1='475' id2='425' similarity=1.0>\n",
      "<Record id1='475' id2='324' similarity=1.0>\n",
      "<Record id1='475' id2='471' similarity=1.0>\n",
      "<Record id1='475' id2='493' similarity=1.0>\n",
      "<Record id1='475' id2='481' similarity=1.0>\n",
      "<Record id1='475' id2='377' similarity=1.0>\n",
      "<Record id1='475' id2='415' similarity=1.0>\n",
      "<Record id1='475' id2='453' similarity=1.0>\n",
      "<Record id1='475' id2='414' similarity=1.0>\n",
      "<Record id1='415' id2='346' similarity=1.0>\n",
      "<Record id1='415' id2='425' similarity=1.0>\n",
      "<Record id1='415' id2='324' similarity=1.0>\n",
      "<Record id1='415' id2='471' similarity=1.0>\n",
      "<Record id1='415' id2='493' similarity=1.0>\n",
      "<Record id1='415' id2='481' similarity=1.0>\n",
      "<Record id1='415' id2='377' similarity=1.0>\n",
      "<Record id1='415' id2='475' similarity=1.0>\n",
      "<Record id1='415' id2='453' similarity=1.0>\n",
      "<Record id1='415' id2='414' similarity=1.0>\n",
      "<Record id1='278' id2='430' similarity=1.0>\n",
      "<Record id1='278' id2='492' similarity=1.0>\n",
      "<Record id1='278' id2='391' similarity=1.0>\n",
      "<Record id1='278' id2='111' similarity=1.0>\n",
      "<Record id1='278' id2='186' similarity=1.0>\n",
      "<Record id1='278' id2='419' similarity=1.0>\n",
      "<Record id1='278' id2='277' similarity=1.0>\n",
      "<Record id1='278' id2='429' similarity=1.0>\n",
      "<Record id1='278' id2='408' similarity=1.0>\n",
      "<Record id1='278' id2='470' similarity=1.0>\n",
      "<Record id1='425' id2='346' similarity=1.0>\n",
      "<Record id1='425' id2='415' similarity=1.0>\n",
      "<Record id1='425' id2='324' similarity=1.0>\n",
      "<Record id1='425' id2='471' similarity=1.0>\n",
      "<Record id1='425' id2='493' similarity=1.0>\n",
      "<Record id1='425' id2='481' similarity=1.0>\n",
      "<Record id1='425' id2='377' similarity=1.0>\n",
      "<Record id1='425' id2='475' similarity=1.0>\n",
      "<Record id1='425' id2='453' similarity=1.0>\n",
      "<Record id1='425' id2='414' similarity=1.0>\n",
      "<Record id1='429' id2='430' similarity=1.0>\n",
      "<Record id1='429' id2='492' similarity=1.0>\n",
      "<Record id1='429' id2='391' similarity=1.0>\n",
      "<Record id1='429' id2='111' similarity=1.0>\n",
      "<Record id1='429' id2='186' similarity=1.0>\n",
      "<Record id1='429' id2='419' similarity=1.0>\n",
      "<Record id1='429' id2='277' similarity=1.0>\n",
      "<Record id1='429' id2='278' similarity=1.0>\n",
      "<Record id1='429' id2='408' similarity=1.0>\n",
      "<Record id1='429' id2='470' similarity=1.0>\n",
      "<Record id1='377' id2='346' similarity=1.0>\n",
      "<Record id1='377' id2='415' similarity=1.0>\n",
      "<Record id1='377' id2='324' similarity=1.0>\n",
      "<Record id1='377' id2='471' similarity=1.0>\n",
      "<Record id1='377' id2='493' similarity=1.0>\n",
      "<Record id1='377' id2='481' similarity=1.0>\n",
      "<Record id1='377' id2='425' similarity=1.0>\n",
      "<Record id1='377' id2='475' similarity=1.0>\n",
      "<Record id1='377' id2='453' similarity=1.0>\n",
      "<Record id1='377' id2='414' similarity=1.0>\n",
      "<Record id1='324' id2='346' similarity=1.0>\n",
      "<Record id1='324' id2='415' similarity=1.0>\n",
      "<Record id1='324' id2='377' similarity=1.0>\n",
      "<Record id1='324' id2='471' similarity=1.0>\n",
      "<Record id1='324' id2='493' similarity=1.0>\n",
      "<Record id1='324' id2='481' similarity=1.0>\n",
      "<Record id1='324' id2='425' similarity=1.0>\n",
      "<Record id1='324' id2='475' similarity=1.0>\n",
      "<Record id1='324' id2='453' similarity=1.0>\n",
      "<Record id1='324' id2='414' similarity=1.0>\n",
      "<Record id1='492' id2='430' similarity=1.0>\n",
      "<Record id1='492' id2='429' similarity=1.0>\n",
      "<Record id1='492' id2='391' similarity=1.0>\n",
      "<Record id1='492' id2='111' similarity=1.0>\n",
      "<Record id1='492' id2='186' similarity=1.0>\n",
      "<Record id1='492' id2='419' similarity=1.0>\n",
      "<Record id1='492' id2='277' similarity=1.0>\n",
      "<Record id1='492' id2='278' similarity=1.0>\n",
      "<Record id1='492' id2='408' similarity=1.0>\n",
      "<Record id1='492' id2='470' similarity=1.0>\n",
      "<Record id1='481' id2='346' similarity=1.0>\n",
      "<Record id1='481' id2='415' similarity=1.0>\n",
      "<Record id1='481' id2='377' similarity=1.0>\n",
      "<Record id1='481' id2='471' similarity=1.0>\n",
      "<Record id1='481' id2='493' similarity=1.0>\n",
      "<Record id1='481' id2='324' similarity=1.0>\n",
      "<Record id1='481' id2='425' similarity=1.0>\n",
      "<Record id1='481' id2='475' similarity=1.0>\n",
      "<Record id1='481' id2='453' similarity=1.0>\n",
      "<Record id1='481' id2='414' similarity=1.0>\n",
      "<Record id1='471' id2='346' similarity=1.0>\n",
      "<Record id1='471' id2='415' similarity=1.0>\n",
      "<Record id1='471' id2='377' similarity=1.0>\n",
      "<Record id1='471' id2='481' similarity=1.0>\n",
      "<Record id1='471' id2='493' similarity=1.0>\n",
      "<Record id1='471' id2='324' similarity=1.0>\n",
      "<Record id1='471' id2='425' similarity=1.0>\n",
      "<Record id1='471' id2='475' similarity=1.0>\n",
      "<Record id1='471' id2='453' similarity=1.0>\n",
      "<Record id1='471' id2='414' similarity=1.0>\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record id1='277' id2='430' similarity=1.0>\n",
      "<Record id1='277' id2='429' similarity=1.0>\n",
      "<Record id1='277' id2='391' similarity=1.0>\n",
      "<Record id1='277' id2='111' similarity=1.0>\n",
      "<Record id1='277' id2='186' similarity=1.0>\n",
      "<Record id1='277' id2='419' similarity=1.0>\n",
      "<Record id1='277' id2='492' similarity=1.0>\n",
      "<Record id1='277' id2='278' similarity=1.0>\n",
      "<Record id1='277' id2='408' similarity=1.0>\n",
      "<Record id1='277' id2='470' similarity=1.0>\n",
      "<Record id1='391' id2='430' similarity=1.0>\n",
      "<Record id1='391' id2='429' similarity=1.0>\n",
      "<Record id1='391' id2='277' similarity=1.0>\n",
      "<Record id1='391' id2='111' similarity=1.0>\n",
      "<Record id1='391' id2='186' similarity=1.0>\n",
      "<Record id1='391' id2='419' similarity=1.0>\n",
      "<Record id1='391' id2='492' similarity=1.0>\n",
      "<Record id1='391' id2='278' similarity=1.0>\n",
      "<Record id1='391' id2='408' similarity=1.0>\n",
      "<Record id1='391' id2='470' similarity=1.0>\n",
      "<Record id1='419' id2='430' similarity=1.0>\n",
      "<Record id1='419' id2='429' similarity=1.0>\n",
      "<Record id1='419' id2='277' similarity=1.0>\n",
      "<Record id1='419' id2='111' similarity=1.0>\n",
      "<Record id1='419' id2='186' similarity=1.0>\n",
      "<Record id1='419' id2='391' similarity=1.0>\n",
      "<Record id1='419' id2='492' similarity=1.0>\n",
      "<Record id1='419' id2='278' similarity=1.0>\n",
      "<Record id1='419' id2='408' similarity=1.0>\n",
      "<Record id1='419' id2='470' similarity=1.0>\n",
      "<Record id1='493' id2='346' similarity=1.0>\n",
      "<Record id1='493' id2='415' similarity=1.0>\n",
      "<Record id1='493' id2='377' similarity=1.0>\n",
      "<Record id1='493' id2='481' similarity=1.0>\n",
      "<Record id1='493' id2='471' similarity=1.0>\n",
      "<Record id1='493' id2='324' similarity=1.0>\n",
      "<Record id1='493' id2='425' similarity=1.0>\n",
      "<Record id1='493' id2='475' similarity=1.0>\n",
      "<Record id1='493' id2='453' similarity=1.0>\n",
      "<Record id1='493' id2='414' similarity=1.0>\n",
      "<Record id1='378' id2='460' similarity=1.0>\n",
      "<Record id1='111' id2='430' similarity=1.0>\n",
      "<Record id1='111' id2='429' similarity=1.0>\n",
      "<Record id1='111' id2='277' similarity=1.0>\n",
      "<Record id1='111' id2='419' similarity=1.0>\n",
      "<Record id1='111' id2='186' similarity=1.0>\n",
      "<Record id1='111' id2='391' similarity=1.0>\n",
      "<Record id1='111' id2='492' similarity=1.0>\n",
      "<Record id1='111' id2='278' similarity=1.0>\n",
      "<Record id1='111' id2='408' similarity=1.0>\n",
      "<Record id1='111' id2='470' similarity=1.0>\n",
      "<Record id1='186' id2='430' similarity=1.0>\n",
      "<Record id1='186' id2='429' similarity=1.0>\n",
      "<Record id1='186' id2='277' similarity=1.0>\n",
      "<Record id1='186' id2='419' similarity=1.0>\n",
      "<Record id1='186' id2='111' similarity=1.0>\n",
      "<Record id1='186' id2='391' similarity=1.0>\n",
      "<Record id1='186' id2='492' similarity=1.0>\n",
      "<Record id1='186' id2='278' similarity=1.0>\n",
      "<Record id1='186' id2='408' similarity=1.0>\n",
      "<Record id1='186' id2='470' similarity=1.0>\n",
      "<Record id1='393' id2='430' similarity=1.0>\n",
      "<Record id1='393' id2='429' similarity=1.0>\n",
      "<Record id1='393' id2='277' similarity=1.0>\n",
      "<Record id1='393' id2='419' similarity=1.0>\n",
      "<Record id1='393' id2='111' similarity=1.0>\n",
      "<Record id1='393' id2='391' similarity=1.0>\n",
      "<Record id1='393' id2='492' similarity=1.0>\n",
      "<Record id1='393' id2='278' similarity=1.0>\n",
      "<Record id1='393' id2='408' similarity=1.0>\n",
      "<Record id1='393' id2='470' similarity=1.0>\n",
      "<Record id1='460' id2='378' similarity=1.0>\n",
      "<Record id1='413' id2='430' similarity=1.0>\n",
      "<Record id1='413' id2='429' similarity=1.0>\n",
      "<Record id1='413' id2='277' similarity=1.0>\n",
      "<Record id1='413' id2='419' similarity=1.0>\n",
      "<Record id1='413' id2='111' similarity=1.0>\n",
      "<Record id1='413' id2='391' similarity=1.0>\n",
      "<Record id1='413' id2='492' similarity=1.0>\n",
      "<Record id1='413' id2='278' similarity=1.0>\n",
      "<Record id1='413' id2='408' similarity=1.0>\n",
      "<Record id1='413' id2='470' similarity=1.0>\n",
      "<Record id1='358' id2='346' similarity=1.0>\n",
      "<Record id1='358' id2='415' similarity=1.0>\n",
      "<Record id1='358' id2='377' similarity=1.0>\n",
      "<Record id1='358' id2='481' similarity=1.0>\n",
      "<Record id1='358' id2='471' similarity=1.0>\n",
      "<Record id1='358' id2='324' similarity=1.0>\n",
      "<Record id1='358' id2='425' similarity=1.0>\n",
      "<Record id1='358' id2='475' similarity=1.0>\n",
      "<Record id1='358' id2='453' similarity=1.0>\n",
      "<Record id1='358' id2='414' similarity=1.0>\n",
      "<Record id1='463' id2='346' similarity=1.0>\n",
      "<Record id1='463' id2='415' similarity=1.0>\n",
      "<Record id1='463' id2='377' similarity=1.0>\n",
      "<Record id1='463' id2='481' similarity=1.0>\n",
      "<Record id1='463' id2='471' similarity=1.0>\n",
      "<Record id1='463' id2='324' similarity=1.0>\n",
      "<Record id1='463' id2='425' similarity=1.0>\n",
      "<Record id1='463' id2='475' similarity=1.0>\n",
      "<Record id1='463' id2='453' similarity=1.0>\n",
      "<Record id1='463' id2='414' similarity=1.0>\n",
      "<Record id1='392' id2='430' similarity=1.0>\n",
      "<Record id1='392' id2='429' similarity=1.0>\n",
      "<Record id1='392' id2='277' similarity=1.0>\n",
      "<Record id1='392' id2='419' similarity=1.0>\n",
      "<Record id1='392' id2='111' similarity=1.0>\n",
      "<Record id1='392' id2='391' similarity=1.0>\n",
      "<Record id1='392' id2='492' similarity=1.0>\n",
      "<Record id1='392' id2='278' similarity=1.0>\n",
      "<Record id1='392' id2='408' similarity=1.0>\n",
      "<Record id1='392' id2='470' similarity=1.0>\n",
      "<Record id1='338' id2='346' similarity=1.0>\n",
      "<Record id1='338' id2='415' similarity=1.0>\n",
      "<Record id1='338' id2='377' similarity=1.0>\n",
      "<Record id1='338' id2='481' similarity=1.0>\n",
      "<Record id1='338' id2='471' similarity=1.0>\n",
      "<Record id1='338' id2='324' similarity=1.0>\n",
      "<Record id1='338' id2='425' similarity=1.0>\n",
      "<Record id1='338' id2='475' similarity=1.0>\n",
      "<Record id1='338' id2='453' similarity=1.0>\n",
      "<Record id1='338' id2='414' similarity=1.0>\n",
      "<Record id1='612' id2='599' similarity=1.0>\n",
      "<Record id1='612' id2='610' similarity=1.0>\n",
      "<Record id1='612' id2='303' similarity=1.0>\n",
      "<Record id1='303' id2='599' similarity=1.0>\n",
      "<Record id1='303' id2='610' similarity=1.0>\n",
      "<Record id1='303' id2='612' similarity=1.0>\n",
      "<Record id1='119' id2='85' similarity=1.0>\n",
      "<Record id1='610' id2='599' similarity=1.0>\n",
      "<Record id1='610' id2='303' similarity=1.0>\n",
      "<Record id1='610' id2='612' similarity=1.0>\n",
      "<Record id1='85' id2='119' similarity=1.0>\n",
      "<Record id1='599' id2='610' similarity=1.0>\n",
      "<Record id1='599' id2='303' similarity=1.0>\n",
      "<Record id1='599' id2='612' similarity=1.0>\n",
      "<Record id1='154' id2='150' similarity=1.0>\n",
      "<Record id1='150' id2='154' similarity=1.0>\n",
      "<Record id1='155' id2='151' similarity=1.0>\n",
      "<Record id1='151' id2='155' similarity=1.0>\n",
      "<Record id1='180' id2='650' similarity=1.0>\n",
      "<Record id1='180' id2='633' similarity=1.0>\n",
      "<Record id1='180' id2='602' similarity=1.0>\n",
      "<Record id1='180' id2='627' similarity=1.0>\n",
      "<Record id1='180' id2='543' similarity=1.0>\n",
      "<Record id1='180' id2='601' similarity=1.0>\n",
      "<Record id1='180' id2='603' similarity=1.0>\n",
      "<Record id1='180' id2='600' similarity=1.0>\n",
      "<Record id1='180' id2='721' similarity=1.0>\n",
      "<Record id1='721' id2='650' similarity=1.0>\n",
      "<Record id1='721' id2='633' similarity=1.0>\n",
      "<Record id1='721' id2='602' similarity=1.0>\n",
      "<Record id1='721' id2='627' similarity=1.0>\n",
      "<Record id1='721' id2='543' similarity=1.0>\n",
      "<Record id1='721' id2='601' similarity=1.0>\n",
      "<Record id1='721' id2='603' similarity=1.0>\n",
      "<Record id1='721' id2='600' similarity=1.0>\n",
      "<Record id1='721' id2='180' similarity=1.0>\n",
      "<Record id1='600' id2='650' similarity=1.0>\n",
      "<Record id1='600' id2='633' similarity=1.0>\n",
      "<Record id1='600' id2='602' similarity=1.0>\n",
      "<Record id1='600' id2='627' similarity=1.0>\n",
      "<Record id1='600' id2='543' similarity=1.0>\n",
      "<Record id1='600' id2='601' similarity=1.0>\n",
      "<Record id1='600' id2='603' similarity=1.0>\n",
      "<Record id1='600' id2='721' similarity=1.0>\n",
      "<Record id1='600' id2='180' similarity=1.0>\n",
      "<Record id1='563' id2='81' similarity=1.0>\n",
      "<Record id1='563' id2='117' similarity=1.0>\n",
      "<Record id1='563' id2='82' similarity=1.0>\n",
      "<Record id1='82' id2='81' similarity=1.0>\n",
      "<Record id1='82' id2='117' similarity=1.0>\n",
      "<Record id1='82' id2='563' similarity=1.0>\n",
      "<Record id1='179' id2='178' similarity=1.0>\n",
      "<Record id1='650' id2='600' similarity=1.0>\n",
      "<Record id1='650' id2='633' similarity=1.0>\n",
      "<Record id1='650' id2='602' similarity=1.0>\n",
      "<Record id1='650' id2='627' similarity=1.0>\n",
      "<Record id1='650' id2='543' similarity=1.0>\n",
      "<Record id1='650' id2='601' similarity=1.0>\n",
      "<Record id1='650' id2='603' similarity=1.0>\n",
      "<Record id1='650' id2='721' similarity=1.0>\n",
      "<Record id1='650' id2='180' similarity=1.0>\n",
      "<Record id1='603' id2='600' similarity=1.0>\n",
      "<Record id1='603' id2='633' similarity=1.0>\n",
      "<Record id1='603' id2='602' similarity=1.0>\n",
      "<Record id1='603' id2='627' similarity=1.0>\n",
      "<Record id1='603' id2='543' similarity=1.0>\n",
      "<Record id1='603' id2='601' similarity=1.0>\n",
      "<Record id1='603' id2='650' similarity=1.0>\n",
      "<Record id1='603' id2='721' similarity=1.0>\n",
      "<Record id1='603' id2='180' similarity=1.0>\n",
      "<Record id1='633' id2='600' similarity=1.0>\n",
      "<Record id1='633' id2='603' similarity=1.0>\n",
      "<Record id1='633' id2='602' similarity=1.0>\n",
      "<Record id1='633' id2='627' similarity=1.0>\n",
      "<Record id1='633' id2='543' similarity=1.0>\n",
      "<Record id1='633' id2='601' similarity=1.0>\n",
      "<Record id1='633' id2='650' similarity=1.0>\n",
      "<Record id1='633' id2='721' similarity=1.0>\n",
      "<Record id1='633' id2='180' similarity=1.0>\n",
      "<Record id1='117' id2='81' similarity=1.0>\n",
      "<Record id1='117' id2='82' similarity=1.0>\n",
      "<Record id1='117' id2='563' similarity=1.0>\n",
      "<Record id1='601' id2='600' similarity=1.0>\n",
      "<Record id1='601' id2='603' similarity=1.0>\n",
      "<Record id1='601' id2='602' similarity=1.0>\n",
      "<Record id1='601' id2='627' similarity=1.0>\n",
      "<Record id1='601' id2='543' similarity=1.0>\n",
      "<Record id1='601' id2='633' similarity=1.0>\n",
      "<Record id1='601' id2='650' similarity=1.0>\n",
      "<Record id1='601' id2='721' similarity=1.0>\n",
      "<Record id1='601' id2='180' similarity=1.0>\n",
      "<Record id1='602' id2='600' similarity=1.0>\n",
      "<Record id1='602' id2='603' similarity=1.0>\n",
      "<Record id1='602' id2='601' similarity=1.0>\n",
      "<Record id1='602' id2='627' similarity=1.0>\n",
      "<Record id1='602' id2='543' similarity=1.0>\n",
      "<Record id1='602' id2='633' similarity=1.0>\n",
      "<Record id1='602' id2='650' similarity=1.0>\n",
      "<Record id1='602' id2='721' similarity=1.0>\n",
      "<Record id1='602' id2='180' similarity=1.0>\n",
      "<Record id1='543' id2='600' similarity=1.0>\n",
      "<Record id1='543' id2='603' similarity=1.0>\n",
      "<Record id1='543' id2='601' similarity=1.0>\n",
      "<Record id1='543' id2='627' similarity=1.0>\n",
      "<Record id1='543' id2='602' similarity=1.0>\n",
      "<Record id1='543' id2='633' similarity=1.0>\n",
      "<Record id1='543' id2='650' similarity=1.0>\n",
      "<Record id1='543' id2='721' similarity=1.0>\n",
      "<Record id1='543' id2='180' similarity=1.0>\n",
      "<Record id1='178' id2='179' similarity=1.0>\n",
      "<Record id1='81' id2='117' similarity=1.0>\n",
      "<Record id1='81' id2='82' similarity=1.0>\n",
      "<Record id1='81' id2='563' similarity=1.0>\n",
      "<Record id1='627' id2='600' similarity=1.0>\n",
      "<Record id1='627' id2='603' similarity=1.0>\n",
      "<Record id1='627' id2='601' similarity=1.0>\n",
      "<Record id1='627' id2='543' similarity=1.0>\n",
      "<Record id1='627' id2='602' similarity=1.0>\n",
      "<Record id1='627' id2='633' similarity=1.0>\n",
      "<Record id1='627' id2='650' similarity=1.0>\n",
      "<Record id1='627' id2='721' similarity=1.0>\n",
      "<Record id1='627' id2='180' similarity=1.0>\n",
      "<Record id1='116' id2='645' similarity=1.0>\n",
      "<Record id1='116' id2='541' similarity=1.0>\n",
      "<Record id1='116' id2='697' similarity=1.0>\n",
      "<Record id1='697' id2='645' similarity=1.0>\n",
      "<Record id1='697' id2='541' similarity=1.0>\n",
      "<Record id1='697' id2='116' similarity=1.0>\n",
      "<Record id1='541' id2='645' similarity=1.0>\n",
      "<Record id1='541' id2='697' similarity=1.0>\n",
      "<Record id1='541' id2='116' similarity=1.0>\n",
      "<Record id1='645' id2='541' similarity=1.0>\n",
      "<Record id1='645' id2='697' similarity=1.0>\n",
      "<Record id1='645' id2='116' similarity=1.0>\n",
      "<Record id1='545' id2='652' similarity=1.0>\n",
      "<Record id1='545' id2='647' similarity=1.0>\n",
      "<Record id1='545' id2='183' similarity=1.0>\n",
      "<Record id1='545' id2='724' similarity=1.0>\n",
      "<Record id1='545' id2='746' similarity=1.0>\n",
      "<Record id1='545' id2='637' similarity=1.0>\n",
      "<Record id1='637' id2='652' similarity=1.0>\n",
      "<Record id1='637' id2='647' similarity=1.0>\n",
      "<Record id1='637' id2='183' similarity=1.0>\n",
      "<Record id1='637' id2='724' similarity=1.0>\n",
      "<Record id1='637' id2='746' similarity=1.0>\n",
      "<Record id1='637' id2='545' similarity=1.0>\n",
      "<Record id1='746' id2='652' similarity=1.0>\n",
      "<Record id1='746' id2='647' similarity=1.0>\n",
      "<Record id1='746' id2='183' similarity=1.0>\n",
      "<Record id1='746' id2='724' similarity=1.0>\n",
      "<Record id1='746' id2='637' similarity=1.0>\n",
      "<Record id1='746' id2='545' similarity=1.0>\n",
      "<Record id1='652' id2='746' similarity=1.0>\n",
      "<Record id1='652' id2='647' similarity=1.0>\n",
      "<Record id1='652' id2='183' similarity=1.0>\n",
      "<Record id1='652' id2='724' similarity=1.0>\n",
      "<Record id1='652' id2='637' similarity=1.0>\n",
      "<Record id1='652' id2='545' similarity=1.0>\n",
      "<Record id1='724' id2='746' similarity=1.0>\n",
      "<Record id1='724' id2='647' similarity=1.0>\n",
      "<Record id1='724' id2='183' similarity=1.0>\n",
      "<Record id1='724' id2='652' similarity=1.0>\n",
      "<Record id1='724' id2='637' similarity=1.0>\n",
      "<Record id1='724' id2='545' similarity=1.0>\n",
      "<Record id1='647' id2='746' similarity=1.0>\n",
      "<Record id1='647' id2='724' similarity=1.0>\n",
      "<Record id1='647' id2='183' similarity=1.0>\n",
      "<Record id1='647' id2='652' similarity=1.0>\n",
      "<Record id1='647' id2='637' similarity=1.0>\n",
      "<Record id1='647' id2='545' similarity=1.0>\n",
      "<Record id1='183' id2='746' similarity=1.0>\n",
      "<Record id1='183' id2='724' similarity=1.0>\n",
      "<Record id1='183' id2='647' similarity=1.0>\n",
      "<Record id1='183' id2='652' similarity=1.0>\n",
      "<Record id1='183' id2='637' similarity=1.0>\n",
      "<Record id1='183' id2='545' similarity=1.0>\n",
      "<Record id1='200' id2='195' similarity=1.0>\n",
      "<Record id1='693' id2='547' similarity=1.0>\n",
      "<Record id1='693' id2='692' similarity=1.0>\n",
      "<Record id1='121' id2='249' similarity=1.0>\n",
      "<Record id1='249' id2='121' similarity=1.0>\n",
      "<Record id1='692' id2='547' similarity=1.0>\n",
      "<Record id1='692' id2='693' similarity=1.0>\n",
      "<Record id1='547' id2='692' similarity=1.0>\n",
      "<Record id1='547' id2='693' similarity=1.0>\n",
      "<Record id1='195' id2='200' similarity=1.0>\n",
      "<Record id1='542' id2='691' similarity=1.0>\n",
      "<Record id1='542' id2='646' similarity=1.0>\n",
      "<Record id1='646' id2='691' similarity=1.0>\n",
      "<Record id1='646' id2='542' similarity=1.0>\n",
      "<Record id1='691' id2='646' similarity=1.0>\n",
      "<Record id1='691' id2='542' similarity=1.0>\n",
      "<Record id1='548' id2='302' similarity=1.0>\n",
      "<Record id1='548' id2='727' similarity=1.0>\n",
      "<Record id1='548' id2='726' similarity=1.0>\n",
      "<Record id1='548' id2='546' similarity=1.0>\n",
      "<Record id1='548' id2='611' similarity=1.0>\n",
      "<Record id1='548' id2='181' similarity=1.0>\n",
      "<Record id1='548' id2='598' similarity=1.0>\n",
      "<Record id1='197' id2='657' similarity=1.0>\n",
      "<Record id1='197' id2='658' similarity=1.0>\n",
      "<Record id1='197' id2='659' similarity=1.0>\n",
      "<Record id1='197' id2='713' similarity=1.0>\n",
      "<Record id1='197' id2='664' similarity=1.0>\n",
      "<Record id1='197' id2='665' similarity=1.0>\n",
      "<Record id1='197' id2='663' similarity=1.0>\n",
      "<Record id1='197' id2='660' similarity=1.0>\n",
      "<Record id1='197' id2='661' similarity=1.0>\n",
      "<Record id1='197' id2='662' similarity=1.0>\n",
      "<Record id1='598' id2='302' similarity=1.0>\n",
      "<Record id1='598' id2='727' similarity=1.0>\n",
      "<Record id1='598' id2='726' similarity=1.0>\n",
      "<Record id1='598' id2='546' similarity=1.0>\n",
      "<Record id1='598' id2='611' similarity=1.0>\n",
      "<Record id1='598' id2='181' similarity=1.0>\n",
      "<Record id1='598' id2='548' similarity=1.0>\n",
      "<Record id1='662' id2='657' similarity=1.0>\n",
      "<Record id1='662' id2='658' similarity=1.0>\n",
      "<Record id1='662' id2='659' similarity=1.0>\n",
      "<Record id1='662' id2='713' similarity=1.0>\n",
      "<Record id1='662' id2='664' similarity=1.0>\n",
      "<Record id1='662' id2='665' similarity=1.0>\n",
      "<Record id1='662' id2='663' similarity=1.0>\n",
      "<Record id1='662' id2='660' similarity=1.0>\n",
      "<Record id1='662' id2='661' similarity=1.0>\n",
      "<Record id1='662' id2='197' similarity=1.0>\n",
      "<Record id1='181' id2='302' similarity=1.0>\n",
      "<Record id1='181' id2='727' similarity=1.0>\n",
      "<Record id1='181' id2='726' similarity=1.0>\n",
      "<Record id1='181' id2='546' similarity=1.0>\n",
      "<Record id1='181' id2='611' similarity=1.0>\n",
      "<Record id1='181' id2='598' similarity=1.0>\n",
      "<Record id1='181' id2='548' similarity=1.0>\n",
      "<Record id1='302' id2='181' similarity=1.0>\n",
      "<Record id1='302' id2='727' similarity=1.0>\n",
      "<Record id1='302' id2='726' similarity=1.0>\n",
      "<Record id1='302' id2='546' similarity=1.0>\n",
      "<Record id1='302' id2='611' similarity=1.0>\n",
      "<Record id1='302' id2='598' similarity=1.0>\n",
      "<Record id1='302' id2='548' similarity=1.0>\n",
      "<Record id1='611' id2='181' similarity=1.0>\n",
      "<Record id1='611' id2='727' similarity=1.0>\n",
      "<Record id1='611' id2='726' similarity=1.0>\n",
      "<Record id1='611' id2='546' similarity=1.0>\n",
      "<Record id1='611' id2='302' similarity=1.0>\n",
      "<Record id1='611' id2='598' similarity=1.0>\n",
      "<Record id1='611' id2='548' similarity=1.0>\n",
      "<Record id1='661' id2='657' similarity=1.0>\n",
      "<Record id1='661' id2='658' similarity=1.0>\n",
      "<Record id1='661' id2='659' similarity=1.0>\n",
      "<Record id1='661' id2='713' similarity=1.0>\n",
      "<Record id1='661' id2='664' similarity=1.0>\n",
      "<Record id1='661' id2='665' similarity=1.0>\n",
      "<Record id1='661' id2='663' similarity=1.0>\n",
      "<Record id1='661' id2='660' similarity=1.0>\n",
      "<Record id1='661' id2='662' similarity=1.0>\n",
      "<Record id1='661' id2='197' similarity=1.0>\n",
      "<Record id1='657' id2='661' similarity=1.0>\n",
      "<Record id1='657' id2='658' similarity=1.0>\n",
      "<Record id1='657' id2='659' similarity=1.0>\n",
      "<Record id1='657' id2='713' similarity=1.0>\n",
      "<Record id1='657' id2='664' similarity=1.0>\n",
      "<Record id1='657' id2='665' similarity=1.0>\n",
      "<Record id1='657' id2='663' similarity=1.0>\n",
      "<Record id1='657' id2='660' similarity=1.0>\n",
      "<Record id1='657' id2='662' similarity=1.0>\n",
      "<Record id1='657' id2='197' similarity=1.0>\n",
      "<Record id1='727' id2='181' similarity=1.0>\n",
      "<Record id1='727' id2='611' similarity=1.0>\n",
      "<Record id1='727' id2='726' similarity=1.0>\n",
      "<Record id1='727' id2='546' similarity=1.0>\n",
      "<Record id1='727' id2='302' similarity=1.0>\n",
      "<Record id1='727' id2='598' similarity=1.0>\n",
      "<Record id1='727' id2='548' similarity=1.0>\n",
      "<Record id1='660' id2='661' similarity=1.0>\n",
      "<Record id1='660' id2='658' similarity=1.0>\n",
      "<Record id1='660' id2='659' similarity=1.0>\n",
      "<Record id1='660' id2='713' similarity=1.0>\n",
      "<Record id1='660' id2='664' similarity=1.0>\n",
      "<Record id1='660' id2='665' similarity=1.0>\n",
      "<Record id1='660' id2='663' similarity=1.0>\n",
      "<Record id1='660' id2='657' similarity=1.0>\n",
      "<Record id1='660' id2='662' similarity=1.0>\n",
      "<Record id1='660' id2='197' similarity=1.0>\n",
      "<Record id1='658' id2='661' similarity=1.0>\n",
      "<Record id1='658' id2='660' similarity=1.0>\n",
      "<Record id1='658' id2='659' similarity=1.0>\n",
      "<Record id1='658' id2='713' similarity=1.0>\n",
      "<Record id1='658' id2='664' similarity=1.0>\n",
      "<Record id1='658' id2='665' similarity=1.0>\n",
      "<Record id1='658' id2='663' similarity=1.0>\n",
      "<Record id1='658' id2='657' similarity=1.0>\n",
      "<Record id1='658' id2='662' similarity=1.0>\n",
      "<Record id1='658' id2='197' similarity=1.0>\n",
      "<Record id1='663' id2='661' similarity=1.0>\n",
      "<Record id1='663' id2='660' similarity=1.0>\n",
      "<Record id1='663' id2='659' similarity=1.0>\n",
      "<Record id1='663' id2='713' similarity=1.0>\n",
      "<Record id1='663' id2='664' similarity=1.0>\n",
      "<Record id1='663' id2='665' similarity=1.0>\n",
      "<Record id1='663' id2='658' similarity=1.0>\n",
      "<Record id1='663' id2='657' similarity=1.0>\n",
      "<Record id1='663' id2='662' similarity=1.0>\n",
      "<Record id1='663' id2='197' similarity=1.0>\n",
      "<Record id1='546' id2='181' similarity=1.0>\n",
      "<Record id1='546' id2='611' similarity=1.0>\n",
      "<Record id1='546' id2='726' similarity=1.0>\n",
      "<Record id1='546' id2='727' similarity=1.0>\n",
      "<Record id1='546' id2='302' similarity=1.0>\n",
      "<Record id1='546' id2='598' similarity=1.0>\n",
      "<Record id1='546' id2='548' similarity=1.0>\n",
      "<Record id1='659' id2='661' similarity=1.0>\n",
      "<Record id1='659' id2='660' similarity=1.0>\n",
      "<Record id1='659' id2='663' similarity=1.0>\n",
      "<Record id1='659' id2='713' similarity=1.0>\n",
      "<Record id1='659' id2='664' similarity=1.0>\n",
      "<Record id1='659' id2='665' similarity=1.0>\n",
      "<Record id1='659' id2='658' similarity=1.0>\n",
      "<Record id1='659' id2='657' similarity=1.0>\n",
      "<Record id1='659' id2='662' similarity=1.0>\n",
      "<Record id1='659' id2='197' similarity=1.0>\n",
      "<Record id1='665' id2='661' similarity=1.0>\n",
      "<Record id1='665' id2='660' similarity=1.0>\n",
      "<Record id1='665' id2='663' similarity=1.0>\n",
      "<Record id1='665' id2='713' similarity=1.0>\n",
      "<Record id1='665' id2='664' similarity=1.0>\n",
      "<Record id1='665' id2='659' similarity=1.0>\n",
      "<Record id1='665' id2='658' similarity=1.0>\n",
      "<Record id1='665' id2='657' similarity=1.0>\n",
      "<Record id1='665' id2='662' similarity=1.0>\n",
      "<Record id1='665' id2='197' similarity=1.0>\n",
      "<Record id1='726' id2='181' similarity=1.0>\n",
      "<Record id1='726' id2='611' similarity=1.0>\n",
      "<Record id1='726' id2='546' similarity=1.0>\n",
      "<Record id1='726' id2='727' similarity=1.0>\n",
      "<Record id1='726' id2='302' similarity=1.0>\n",
      "<Record id1='726' id2='598' similarity=1.0>\n",
      "<Record id1='726' id2='548' similarity=1.0>\n",
      "<Record id1='713' id2='661' similarity=1.0>\n",
      "<Record id1='713' id2='660' similarity=1.0>\n",
      "<Record id1='713' id2='663' similarity=1.0>\n",
      "<Record id1='713' id2='665' similarity=1.0>\n",
      "<Record id1='713' id2='664' similarity=1.0>\n",
      "<Record id1='713' id2='659' similarity=1.0>\n",
      "<Record id1='713' id2='658' similarity=1.0>\n",
      "<Record id1='713' id2='657' similarity=1.0>\n",
      "<Record id1='713' id2='662' similarity=1.0>\n",
      "<Record id1='713' id2='197' similarity=1.0>\n",
      "<Record id1='664' id2='661' similarity=1.0>\n",
      "<Record id1='664' id2='660' similarity=1.0>\n",
      "<Record id1='664' id2='663' similarity=1.0>\n",
      "<Record id1='664' id2='665' similarity=1.0>\n",
      "<Record id1='664' id2='713' similarity=1.0>\n",
      "<Record id1='664' id2='659' similarity=1.0>\n",
      "<Record id1='664' id2='658' similarity=1.0>\n",
      "<Record id1='664' id2='657' similarity=1.0>\n",
      "<Record id1='664' id2='662' similarity=1.0>\n",
      "<Record id1='664' id2='197' similarity=1.0>\n",
      "<Record id1='723' id2='744' similarity=1.0>\n",
      "<Record id1='723' id2='635' similarity=1.0>\n",
      "<Record id1='723' id2='132' similarity=1.0>\n",
      "<Record id1='199' id2='196' similarity=1.0>\n",
      "<Record id1='132' id2='744' similarity=1.0>\n",
      "<Record id1='132' id2='635' similarity=1.0>\n",
      "<Record id1='132' id2='723' similarity=1.0>\n",
      "<Record id1='635' id2='744' similarity=1.0>\n",
      "<Record id1='635' id2='132' similarity=1.0>\n",
      "<Record id1='635' id2='723' similarity=1.0>\n",
      "<Record id1='744' id2='635' similarity=1.0>\n",
      "<Record id1='744' id2='132' similarity=1.0>\n",
      "<Record id1='744' id2='723' similarity=1.0>\n",
      "<Record id1='196' id2='199' similarity=1.0>\n",
      "<Record id1='690' id2='681' similarity=1.0>\n",
      "<Record id1='690' id2='651' similarity=1.0>\n",
      "<Record id1='690' id2='552' similarity=1.0>\n",
      "<Record id1='690' id2='742' similarity=1.0>\n",
      "<Record id1='690' id2='719' similarity=1.0>\n",
      "<Record id1='690' id2='557' similarity=1.0>\n",
      "<Record id1='690' id2='701' similarity=1.0>\n",
      "<Record id1='690' id2='226' similarity=1.0>\n",
      "<Record id1='690' id2='238' similarity=1.0>\n",
      "<Record id1='690' id2='235' similarity=1.0>\n",
      "<Record id1='145' id2='255' similarity=1.0>\n",
      "<Record id1='145' id2='257' similarity=1.0>\n",
      "<Record id1='145' id2='253' similarity=1.0>\n",
      "<Record id1='145' id2='256' similarity=1.0>\n",
      "<Record id1='145' id2='251' similarity=1.0>\n",
      "<Record id1='145' id2='254' similarity=1.0>\n",
      "<Record id1='145' id2='252' similarity=1.0>\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record id1='145' id2='250' similarity=1.0>\n",
      "<Record id1='474' id2='351' similarity=1.0>\n",
      "<Record id1='474' id2='275' similarity=1.0>\n",
      "<Record id1='474' id2='229' similarity=1.0>\n",
      "<Record id1='474' id2='228' similarity=1.0>\n",
      "<Record id1='474' id2='472' similarity=1.0>\n",
      "<Record id1='474' id2='485' similarity=1.0>\n",
      "<Record id1='474' id2='357' similarity=1.0>\n",
      "<Record id1='235' id2='681' similarity=1.0>\n",
      "<Record id1='235' id2='651' similarity=1.0>\n",
      "<Record id1='235' id2='552' similarity=1.0>\n",
      "<Record id1='235' id2='742' similarity=1.0>\n",
      "<Record id1='235' id2='719' similarity=1.0>\n",
      "<Record id1='235' id2='557' similarity=1.0>\n",
      "<Record id1='235' id2='701' similarity=1.0>\n",
      "<Record id1='235' id2='226' similarity=1.0>\n",
      "<Record id1='235' id2='238' similarity=1.0>\n",
      "<Record id1='235' id2='690' similarity=1.0>\n",
      "<Record id1='238' id2='681' similarity=1.0>\n",
      "<Record id1='238' id2='651' similarity=1.0>\n",
      "<Record id1='238' id2='552' similarity=1.0>\n",
      "<Record id1='238' id2='742' similarity=1.0>\n",
      "<Record id1='238' id2='719' similarity=1.0>\n",
      "<Record id1='238' id2='557' similarity=1.0>\n",
      "<Record id1='238' id2='701' similarity=1.0>\n",
      "<Record id1='238' id2='226' similarity=1.0>\n",
      "<Record id1='238' id2='235' similarity=1.0>\n",
      "<Record id1='238' id2='690' similarity=1.0>\n",
      "<Record id1='212' id2='214' similarity=1.0>\n",
      "<Record id1='212' id2='213' similarity=1.0>\n",
      "<Record id1='437' id2='427' similarity=1.0>\n",
      "<Record id1='437' id2='524' similarity=1.0>\n",
      "<Record id1='437' id2='428' similarity=1.0>\n",
      "<Record id1='437' id2='435' similarity=1.0>\n",
      "<Record id1='437' id2='407' similarity=1.0>\n",
      "<Record id1='437' id2='426' similarity=1.0>\n",
      "<Record id1='437' id2='438' similarity=1.0>\n",
      "<Record id1='437' id2='434' similarity=1.0>\n",
      "<Record id1='437' id2='439' similarity=1.0>\n",
      "<Record id1='437' id2='436' similarity=1.0>\n",
      "<Record id1='149' id2='153' similarity=1.0>\n",
      "<Record id1='436' id2='427' similarity=1.0>\n",
      "<Record id1='436' id2='524' similarity=1.0>\n",
      "<Record id1='436' id2='428' similarity=1.0>\n",
      "<Record id1='436' id2='435' similarity=1.0>\n",
      "<Record id1='436' id2='407' similarity=1.0>\n",
      "<Record id1='436' id2='426' similarity=1.0>\n",
      "<Record id1='436' id2='438' similarity=1.0>\n",
      "<Record id1='436' id2='434' similarity=1.0>\n",
      "<Record id1='436' id2='439' similarity=1.0>\n",
      "<Record id1='436' id2='437' similarity=1.0>\n",
      "<Record id1='681' id2='238' similarity=1.0>\n",
      "<Record id1='681' id2='651' similarity=1.0>\n",
      "<Record id1='681' id2='552' similarity=1.0>\n",
      "<Record id1='681' id2='742' similarity=1.0>\n",
      "<Record id1='681' id2='719' similarity=1.0>\n",
      "<Record id1='681' id2='557' similarity=1.0>\n",
      "<Record id1='681' id2='701' similarity=1.0>\n",
      "<Record id1='681' id2='226' similarity=1.0>\n",
      "<Record id1='681' id2='235' similarity=1.0>\n",
      "<Record id1='681' id2='690' similarity=1.0>\n",
      "<Record id1='439' id2='427' similarity=1.0>\n",
      "<Record id1='439' id2='524' similarity=1.0>\n",
      "<Record id1='439' id2='428' similarity=1.0>\n",
      "<Record id1='439' id2='435' similarity=1.0>\n",
      "<Record id1='439' id2='407' similarity=1.0>\n",
      "<Record id1='439' id2='426' similarity=1.0>\n",
      "<Record id1='439' id2='438' similarity=1.0>\n",
      "<Record id1='439' id2='434' similarity=1.0>\n",
      "<Record id1='439' id2='436' similarity=1.0>\n",
      "<Record id1='439' id2='437' similarity=1.0>\n",
      "<Record id1='226' id2='238' similarity=1.0>\n",
      "<Record id1='226' id2='651' similarity=1.0>\n",
      "<Record id1='226' id2='552' similarity=1.0>\n",
      "<Record id1='226' id2='742' similarity=1.0>\n",
      "<Record id1='226' id2='719' similarity=1.0>\n",
      "<Record id1='226' id2='557' similarity=1.0>\n",
      "<Record id1='226' id2='701' similarity=1.0>\n",
      "<Record id1='226' id2='681' similarity=1.0>\n",
      "<Record id1='226' id2='235' similarity=1.0>\n",
      "<Record id1='226' id2='690' similarity=1.0>\n",
      "<Record id1='651' id2='238' similarity=1.0>\n",
      "<Record id1='651' id2='226' similarity=1.0>\n",
      "<Record id1='651' id2='552' similarity=1.0>\n",
      "<Record id1='651' id2='742' similarity=1.0>\n",
      "<Record id1='651' id2='719' similarity=1.0>\n",
      "<Record id1='651' id2='557' similarity=1.0>\n",
      "<Record id1='651' id2='701' similarity=1.0>\n",
      "<Record id1='651' id2='681' similarity=1.0>\n",
      "<Record id1='651' id2='235' similarity=1.0>\n",
      "<Record id1='651' id2='690' similarity=1.0>\n",
      "<Record id1='701' id2='238' similarity=1.0>\n",
      "<Record id1='701' id2='226' similarity=1.0>\n",
      "<Record id1='701' id2='552' similarity=1.0>\n",
      "<Record id1='701' id2='742' similarity=1.0>\n",
      "<Record id1='701' id2='719' similarity=1.0>\n",
      "<Record id1='701' id2='557' similarity=1.0>\n",
      "<Record id1='701' id2='651' similarity=1.0>\n",
      "<Record id1='701' id2='681' similarity=1.0>\n",
      "<Record id1='701' id2='235' similarity=1.0>\n",
      "<Record id1='701' id2='690' similarity=1.0>\n",
      "<Record id1='250' id2='255' similarity=1.0>\n",
      "<Record id1='250' id2='257' similarity=1.0>\n",
      "<Record id1='250' id2='253' similarity=1.0>\n",
      "<Record id1='250' id2='256' similarity=1.0>\n",
      "<Record id1='250' id2='251' similarity=1.0>\n",
      "<Record id1='250' id2='254' similarity=1.0>\n",
      "<Record id1='250' id2='252' similarity=1.0>\n",
      "<Record id1='250' id2='145' similarity=1.0>\n",
      "<Record id1='552' id2='238' similarity=1.0>\n",
      "<Record id1='552' id2='226' similarity=1.0>\n",
      "<Record id1='552' id2='701' similarity=1.0>\n",
      "<Record id1='552' id2='742' similarity=1.0>\n",
      "<Record id1='552' id2='719' similarity=1.0>\n",
      "<Record id1='552' id2='557' similarity=1.0>\n",
      "<Record id1='552' id2='651' similarity=1.0>\n",
      "<Record id1='552' id2='681' similarity=1.0>\n",
      "<Record id1='552' id2='235' similarity=1.0>\n",
      "<Record id1='552' id2='690' similarity=1.0>\n",
      "<Record id1='557' id2='238' similarity=1.0>\n",
      "<Record id1='557' id2='226' similarity=1.0>\n",
      "<Record id1='557' id2='701' similarity=1.0>\n",
      "<Record id1='557' id2='742' similarity=1.0>\n",
      "<Record id1='557' id2='719' similarity=1.0>\n",
      "<Record id1='557' id2='552' similarity=1.0>\n",
      "<Record id1='557' id2='651' similarity=1.0>\n",
      "<Record id1='557' id2='681' similarity=1.0>\n",
      "<Record id1='557' id2='235' similarity=1.0>\n",
      "<Record id1='557' id2='690' similarity=1.0>\n",
      "<Record id1='252' id2='255' similarity=1.0>\n",
      "<Record id1='252' id2='257' similarity=1.0>\n",
      "<Record id1='252' id2='253' similarity=1.0>\n",
      "<Record id1='252' id2='256' similarity=1.0>\n",
      "<Record id1='252' id2='251' similarity=1.0>\n",
      "<Record id1='252' id2='254' similarity=1.0>\n",
      "<Record id1='252' id2='250' similarity=1.0>\n",
      "<Record id1='252' id2='145' similarity=1.0>\n",
      "<Record id1='213' id2='214' similarity=1.0>\n",
      "<Record id1='213' id2='212' similarity=1.0>\n",
      "<Record id1='742' id2='238' similarity=1.0>\n",
      "<Record id1='742' id2='226' similarity=1.0>\n",
      "<Record id1='742' id2='701' similarity=1.0>\n",
      "<Record id1='742' id2='557' similarity=1.0>\n",
      "<Record id1='742' id2='719' similarity=1.0>\n",
      "<Record id1='742' id2='552' similarity=1.0>\n",
      "<Record id1='742' id2='651' similarity=1.0>\n",
      "<Record id1='742' id2='681' similarity=1.0>\n",
      "<Record id1='742' id2='235' similarity=1.0>\n",
      "<Record id1='742' id2='690' similarity=1.0>\n",
      "<Record id1='427' id2='439' similarity=1.0>\n",
      "<Record id1='427' id2='524' similarity=1.0>\n",
      "<Record id1='427' id2='428' similarity=1.0>\n",
      "<Record id1='427' id2='435' similarity=1.0>\n",
      "<Record id1='427' id2='407' similarity=1.0>\n",
      "<Record id1='427' id2='426' similarity=1.0>\n",
      "<Record id1='427' id2='438' similarity=1.0>\n",
      "<Record id1='427' id2='434' similarity=1.0>\n",
      "<Record id1='427' id2='436' similarity=1.0>\n",
      "<Record id1='427' id2='437' similarity=1.0>\n",
      "<Record id1='719' id2='238' similarity=1.0>\n",
      "<Record id1='719' id2='226' similarity=1.0>\n",
      "<Record id1='719' id2='701' similarity=1.0>\n",
      "<Record id1='719' id2='557' similarity=1.0>\n",
      "<Record id1='719' id2='742' similarity=1.0>\n",
      "<Record id1='719' id2='552' similarity=1.0>\n",
      "<Record id1='719' id2='651' similarity=1.0>\n",
      "<Record id1='719' id2='681' similarity=1.0>\n",
      "<Record id1='719' id2='235' similarity=1.0>\n",
      "<Record id1='719' id2='690' similarity=1.0>\n",
      "<Record id1='255' id2='252' similarity=1.0>\n",
      "<Record id1='255' id2='257' similarity=1.0>\n",
      "<Record id1='255' id2='253' similarity=1.0>\n",
      "<Record id1='255' id2='256' similarity=1.0>\n",
      "<Record id1='255' id2='251' similarity=1.0>\n",
      "<Record id1='255' id2='254' similarity=1.0>\n",
      "<Record id1='255' id2='250' similarity=1.0>\n",
      "<Record id1='255' id2='145' similarity=1.0>\n",
      "<Record id1='677' id2='238' similarity=1.0>\n",
      "<Record id1='677' id2='226' similarity=1.0>\n",
      "<Record id1='677' id2='701' similarity=1.0>\n",
      "<Record id1='677' id2='557' similarity=1.0>\n",
      "<Record id1='677' id2='742' similarity=1.0>\n",
      "<Record id1='677' id2='552' similarity=1.0>\n",
      "<Record id1='677' id2='651' similarity=1.0>\n",
      "<Record id1='677' id2='681' similarity=1.0>\n",
      "<Record id1='677' id2='235' similarity=1.0>\n",
      "<Record id1='677' id2='690' similarity=1.0>\n",
      "<Record id1='131' id2='238' similarity=1.0>\n",
      "<Record id1='131' id2='226' similarity=1.0>\n",
      "<Record id1='131' id2='701' similarity=1.0>\n",
      "<Record id1='131' id2='557' similarity=1.0>\n",
      "<Record id1='131' id2='742' similarity=1.0>\n",
      "<Record id1='131' id2='552' similarity=1.0>\n",
      "<Record id1='131' id2='651' similarity=1.0>\n",
      "<Record id1='131' id2='681' similarity=1.0>\n",
      "<Record id1='131' id2='235' similarity=1.0>\n",
      "<Record id1='131' id2='690' similarity=1.0>\n",
      "<Record id1='653' id2='238' similarity=1.0>\n",
      "<Record id1='653' id2='226' similarity=1.0>\n",
      "<Record id1='653' id2='701' similarity=1.0>\n",
      "<Record id1='653' id2='557' similarity=1.0>\n",
      "<Record id1='653' id2='742' similarity=1.0>\n",
      "<Record id1='653' id2='552' similarity=1.0>\n",
      "<Record id1='653' id2='651' similarity=1.0>\n",
      "<Record id1='653' id2='681' similarity=1.0>\n",
      "<Record id1='653' id2='235' similarity=1.0>\n",
      "<Record id1='653' id2='690' similarity=1.0>\n",
      "<Record id1='741' id2='238' similarity=1.0>\n",
      "<Record id1='741' id2='226' similarity=1.0>\n",
      "<Record id1='741' id2='701' similarity=1.0>\n",
      "<Record id1='741' id2='557' similarity=1.0>\n",
      "<Record id1='741' id2='742' similarity=1.0>\n",
      "<Record id1='741' id2='552' similarity=1.0>\n",
      "<Record id1='741' id2='651' similarity=1.0>\n",
      "<Record id1='741' id2='681' similarity=1.0>\n",
      "<Record id1='741' id2='235' similarity=1.0>\n",
      "<Record id1='741' id2='690' similarity=1.0>\n",
      "<Record id1='254' id2='252' similarity=1.0>\n",
      "<Record id1='254' id2='257' similarity=1.0>\n",
      "<Record id1='254' id2='253' similarity=1.0>\n",
      "<Record id1='254' id2='256' similarity=1.0>\n",
      "<Record id1='254' id2='251' similarity=1.0>\n",
      "<Record id1='254' id2='255' similarity=1.0>\n",
      "<Record id1='254' id2='250' similarity=1.0>\n",
      "<Record id1='254' id2='145' similarity=1.0>\n",
      "<Record id1='632' id2='238' similarity=1.0>\n",
      "<Record id1='632' id2='226' similarity=1.0>\n",
      "<Record id1='632' id2='701' similarity=1.0>\n",
      "<Record id1='632' id2='557' similarity=1.0>\n",
      "<Record id1='632' id2='742' similarity=1.0>\n",
      "<Record id1='632' id2='552' similarity=1.0>\n",
      "<Record id1='632' id2='651' similarity=1.0>\n",
      "<Record id1='632' id2='681' similarity=1.0>\n",
      "<Record id1='632' id2='235' similarity=1.0>\n",
      "<Record id1='632' id2='690' similarity=1.0>\n",
      "<Record id1='689' id2='238' similarity=1.0>\n",
      "<Record id1='689' id2='226' similarity=1.0>\n",
      "<Record id1='689' id2='701' similarity=1.0>\n",
      "<Record id1='689' id2='557' similarity=1.0>\n",
      "<Record id1='689' id2='742' similarity=1.0>\n",
      "<Record id1='689' id2='552' similarity=1.0>\n",
      "<Record id1='689' id2='651' similarity=1.0>\n",
      "<Record id1='689' id2='681' similarity=1.0>\n",
      "<Record id1='689' id2='235' similarity=1.0>\n",
      "<Record id1='689' id2='690' similarity=1.0>\n",
      "<Record id1='257' id2='252' similarity=1.0>\n",
      "<Record id1='257' id2='254' similarity=1.0>\n",
      "<Record id1='257' id2='253' similarity=1.0>\n",
      "<Record id1='257' id2='256' similarity=1.0>\n",
      "<Record id1='257' id2='251' similarity=1.0>\n",
      "<Record id1='257' id2='255' similarity=1.0>\n",
      "<Record id1='257' id2='250' similarity=1.0>\n",
      "<Record id1='257' id2='145' similarity=1.0>\n",
      "<Record id1='720' id2='238' similarity=1.0>\n",
      "<Record id1='720' id2='226' similarity=1.0>\n",
      "<Record id1='720' id2='701' similarity=1.0>\n",
      "<Record id1='720' id2='557' similarity=1.0>\n",
      "<Record id1='720' id2='742' similarity=1.0>\n",
      "<Record id1='720' id2='552' similarity=1.0>\n",
      "<Record id1='720' id2='651' similarity=1.0>\n",
      "<Record id1='720' id2='681' similarity=1.0>\n",
      "<Record id1='720' id2='235' similarity=1.0>\n",
      "<Record id1='720' id2='690' similarity=1.0>\n",
      "<Record id1='357' id2='351' similarity=1.0>\n",
      "<Record id1='357' id2='275' similarity=1.0>\n",
      "<Record id1='357' id2='229' similarity=1.0>\n",
      "<Record id1='357' id2='228' similarity=1.0>\n",
      "<Record id1='357' id2='472' similarity=1.0>\n",
      "<Record id1='357' id2='485' similarity=1.0>\n",
      "<Record id1='357' id2='474' similarity=1.0>\n",
      "<Record id1='678' id2='238' similarity=1.0>\n",
      "<Record id1='678' id2='226' similarity=1.0>\n",
      "<Record id1='678' id2='701' similarity=1.0>\n",
      "<Record id1='678' id2='557' similarity=1.0>\n",
      "<Record id1='678' id2='742' similarity=1.0>\n",
      "<Record id1='678' id2='552' similarity=1.0>\n",
      "<Record id1='678' id2='651' similarity=1.0>\n",
      "<Record id1='678' id2='681' similarity=1.0>\n",
      "<Record id1='678' id2='235' similarity=1.0>\n",
      "<Record id1='678' id2='690' similarity=1.0>\n",
      "<Record id1='702' id2='238' similarity=1.0>\n",
      "<Record id1='702' id2='226' similarity=1.0>\n",
      "<Record id1='702' id2='701' similarity=1.0>\n",
      "<Record id1='702' id2='557' similarity=1.0>\n",
      "<Record id1='702' id2='742' similarity=1.0>\n",
      "<Record id1='702' id2='552' similarity=1.0>\n",
      "<Record id1='702' id2='651' similarity=1.0>\n",
      "<Record id1='702' id2='681' similarity=1.0>\n",
      "<Record id1='702' id2='235' similarity=1.0>\n",
      "<Record id1='702' id2='690' similarity=1.0>\n",
      "<Record id1='485' id2='351' similarity=1.0>\n",
      "<Record id1='485' id2='275' similarity=1.0>\n",
      "<Record id1='485' id2='229' similarity=1.0>\n",
      "<Record id1='485' id2='228' similarity=1.0>\n",
      "<Record id1='485' id2='472' similarity=1.0>\n",
      "<Record id1='485' id2='357' similarity=1.0>\n",
      "<Record id1='485' id2='474' similarity=1.0>\n",
      "<Record id1='351' id2='485' similarity=1.0>\n",
      "<Record id1='351' id2='275' similarity=1.0>\n",
      "<Record id1='351' id2='229' similarity=1.0>\n",
      "<Record id1='351' id2='228' similarity=1.0>\n",
      "<Record id1='351' id2='472' similarity=1.0>\n",
      "<Record id1='351' id2='357' similarity=1.0>\n",
      "<Record id1='351' id2='474' similarity=1.0>\n",
      "<Record id1='434' id2='439' similarity=1.0>\n",
      "<Record id1='434' id2='524' similarity=1.0>\n",
      "<Record id1='434' id2='428' similarity=1.0>\n",
      "<Record id1='434' id2='435' similarity=1.0>\n",
      "<Record id1='434' id2='407' similarity=1.0>\n",
      "<Record id1='434' id2='426' similarity=1.0>\n",
      "<Record id1='434' id2='438' similarity=1.0>\n",
      "<Record id1='434' id2='427' similarity=1.0>\n",
      "<Record id1='434' id2='436' similarity=1.0>\n",
      "<Record id1='434' id2='437' similarity=1.0>\n",
      "<Record id1='227' id2='238' similarity=1.0>\n",
      "<Record id1='227' id2='226' similarity=1.0>\n",
      "<Record id1='227' id2='701' similarity=1.0>\n",
      "<Record id1='227' id2='557' similarity=1.0>\n",
      "<Record id1='227' id2='742' similarity=1.0>\n",
      "<Record id1='227' id2='552' similarity=1.0>\n",
      "<Record id1='227' id2='651' similarity=1.0>\n",
      "<Record id1='227' id2='681' similarity=1.0>\n",
      "<Record id1='227' id2='235' similarity=1.0>\n",
      "<Record id1='227' id2='690' similarity=1.0>\n",
      "<Record id1='715' id2='238' similarity=1.0>\n",
      "<Record id1='715' id2='226' similarity=1.0>\n",
      "<Record id1='715' id2='701' similarity=1.0>\n",
      "<Record id1='715' id2='557' similarity=1.0>\n",
      "<Record id1='715' id2='742' similarity=1.0>\n",
      "<Record id1='715' id2='552' similarity=1.0>\n",
      "<Record id1='715' id2='651' similarity=1.0>\n",
      "<Record id1='715' id2='681' similarity=1.0>\n",
      "<Record id1='715' id2='235' similarity=1.0>\n",
      "<Record id1='715' id2='690' similarity=1.0>\n",
      "<Record id1='251' id2='252' similarity=1.0>\n",
      "<Record id1='251' id2='254' similarity=1.0>\n",
      "<Record id1='251' id2='253' similarity=1.0>\n",
      "<Record id1='251' id2='256' similarity=1.0>\n",
      "<Record id1='251' id2='257' similarity=1.0>\n",
      "<Record id1='251' id2='255' similarity=1.0>\n",
      "<Record id1='251' id2='250' similarity=1.0>\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record id1='251' id2='145' similarity=1.0>\n",
      "<Record id1='717' id2='238' similarity=1.0>\n",
      "<Record id1='717' id2='226' similarity=1.0>\n",
      "<Record id1='717' id2='701' similarity=1.0>\n",
      "<Record id1='717' id2='557' similarity=1.0>\n",
      "<Record id1='717' id2='742' similarity=1.0>\n",
      "<Record id1='717' id2='552' similarity=1.0>\n",
      "<Record id1='717' id2='651' similarity=1.0>\n",
      "<Record id1='717' id2='681' similarity=1.0>\n",
      "<Record id1='717' id2='235' similarity=1.0>\n",
      "<Record id1='717' id2='690' similarity=1.0>\n",
      "<Record id1='524' id2='439' similarity=1.0>\n",
      "<Record id1='524' id2='434' similarity=1.0>\n",
      "<Record id1='524' id2='428' similarity=1.0>\n",
      "<Record id1='524' id2='435' similarity=1.0>\n",
      "<Record id1='524' id2='407' similarity=1.0>\n",
      "<Record id1='524' id2='426' similarity=1.0>\n",
      "<Record id1='524' id2='438' similarity=1.0>\n",
      "<Record id1='524' id2='427' similarity=1.0>\n",
      "<Record id1='524' id2='436' similarity=1.0>\n",
      "<Record id1='524' id2='437' similarity=1.0>\n",
      "<Record id1='472' id2='485' similarity=1.0>\n",
      "<Record id1='472' id2='275' similarity=1.0>\n",
      "<Record id1='472' id2='229' similarity=1.0>\n",
      "<Record id1='472' id2='228' similarity=1.0>\n",
      "<Record id1='472' id2='351' similarity=1.0>\n",
      "<Record id1='472' id2='357' similarity=1.0>\n",
      "<Record id1='472' id2='474' similarity=1.0>\n",
      "<Record id1='253' id2='252' similarity=1.0>\n",
      "<Record id1='253' id2='254' similarity=1.0>\n",
      "<Record id1='253' id2='251' similarity=1.0>\n",
      "<Record id1='253' id2='256' similarity=1.0>\n",
      "<Record id1='253' id2='257' similarity=1.0>\n",
      "<Record id1='253' id2='255' similarity=1.0>\n",
      "<Record id1='253' id2='250' similarity=1.0>\n",
      "<Record id1='253' id2='145' similarity=1.0>\n",
      "<Record id1='275' id2='485' similarity=1.0>\n",
      "<Record id1='275' id2='472' similarity=1.0>\n",
      "<Record id1='275' id2='229' similarity=1.0>\n",
      "<Record id1='275' id2='228' similarity=1.0>\n",
      "<Record id1='275' id2='351' similarity=1.0>\n",
      "<Record id1='275' id2='357' similarity=1.0>\n",
      "<Record id1='275' id2='474' similarity=1.0>\n",
      "<Record id1='716' id2='238' similarity=1.0>\n",
      "<Record id1='716' id2='226' similarity=1.0>\n",
      "<Record id1='716' id2='701' similarity=1.0>\n",
      "<Record id1='716' id2='557' similarity=1.0>\n",
      "<Record id1='716' id2='742' similarity=1.0>\n",
      "<Record id1='716' id2='552' similarity=1.0>\n",
      "<Record id1='716' id2='651' similarity=1.0>\n",
      "<Record id1='716' id2='681' similarity=1.0>\n",
      "<Record id1='716' id2='235' similarity=1.0>\n",
      "<Record id1='716' id2='690' similarity=1.0>\n",
      "<Record id1='728' id2='238' similarity=1.0>\n",
      "<Record id1='728' id2='226' similarity=1.0>\n",
      "<Record id1='728' id2='701' similarity=1.0>\n",
      "<Record id1='728' id2='557' similarity=1.0>\n",
      "<Record id1='728' id2='742' similarity=1.0>\n",
      "<Record id1='728' id2='552' similarity=1.0>\n",
      "<Record id1='728' id2='651' similarity=1.0>\n",
      "<Record id1='728' id2='681' similarity=1.0>\n",
      "<Record id1='728' id2='235' similarity=1.0>\n",
      "<Record id1='728' id2='690' similarity=1.0>\n",
      "<Record id1='214' id2='213' similarity=1.0>\n",
      "<Record id1='214' id2='212' similarity=1.0>\n",
      "<Record id1='438' id2='439' similarity=1.0>\n",
      "<Record id1='438' id2='434' similarity=1.0>\n",
      "<Record id1='438' id2='428' similarity=1.0>\n",
      "<Record id1='438' id2='435' similarity=1.0>\n",
      "<Record id1='438' id2='407' similarity=1.0>\n",
      "<Record id1='438' id2='426' similarity=1.0>\n",
      "<Record id1='438' id2='524' similarity=1.0>\n",
      "<Record id1='438' id2='427' similarity=1.0>\n",
      "<Record id1='438' id2='436' similarity=1.0>\n",
      "<Record id1='438' id2='437' similarity=1.0>\n",
      "<Record id1='182' id2='238' similarity=1.0>\n",
      "<Record id1='182' id2='226' similarity=1.0>\n",
      "<Record id1='182' id2='701' similarity=1.0>\n",
      "<Record id1='182' id2='557' similarity=1.0>\n",
      "<Record id1='182' id2='742' similarity=1.0>\n",
      "<Record id1='182' id2='552' similarity=1.0>\n",
      "<Record id1='182' id2='651' similarity=1.0>\n",
      "<Record id1='182' id2='681' similarity=1.0>\n",
      "<Record id1='182' id2='235' similarity=1.0>\n",
      "<Record id1='182' id2='690' similarity=1.0>\n",
      "<Record id1='256' id2='252' similarity=1.0>\n",
      "<Record id1='256' id2='254' similarity=1.0>\n",
      "<Record id1='256' id2='251' similarity=1.0>\n",
      "<Record id1='256' id2='253' similarity=1.0>\n",
      "<Record id1='256' id2='257' similarity=1.0>\n",
      "<Record id1='256' id2='255' similarity=1.0>\n",
      "<Record id1='256' id2='250' similarity=1.0>\n",
      "<Record id1='256' id2='145' similarity=1.0>\n",
      "<Record id1='558' id2='238' similarity=1.0>\n",
      "<Record id1='558' id2='226' similarity=1.0>\n",
      "<Record id1='558' id2='701' similarity=1.0>\n",
      "<Record id1='558' id2='557' similarity=1.0>\n",
      "<Record id1='558' id2='742' similarity=1.0>\n",
      "<Record id1='558' id2='552' similarity=1.0>\n",
      "<Record id1='558' id2='651' similarity=1.0>\n",
      "<Record id1='558' id2='681' similarity=1.0>\n",
      "<Record id1='558' id2='235' similarity=1.0>\n",
      "<Record id1='558' id2='690' similarity=1.0>\n",
      "<Record id1='624' id2='238' similarity=1.0>\n",
      "<Record id1='624' id2='226' similarity=1.0>\n",
      "<Record id1='624' id2='701' similarity=1.0>\n",
      "<Record id1='624' id2='557' similarity=1.0>\n",
      "<Record id1='624' id2='742' similarity=1.0>\n",
      "<Record id1='624' id2='552' similarity=1.0>\n",
      "<Record id1='624' id2='651' similarity=1.0>\n",
      "<Record id1='624' id2='681' similarity=1.0>\n",
      "<Record id1='624' id2='235' similarity=1.0>\n",
      "<Record id1='624' id2='690' similarity=1.0>\n",
      "<Record id1='153' id2='149' similarity=1.0>\n",
      "<Record id1='428' id2='439' similarity=1.0>\n",
      "<Record id1='428' id2='434' similarity=1.0>\n",
      "<Record id1='428' id2='438' similarity=1.0>\n",
      "<Record id1='428' id2='435' similarity=1.0>\n",
      "<Record id1='428' id2='407' similarity=1.0>\n",
      "<Record id1='428' id2='426' similarity=1.0>\n",
      "<Record id1='428' id2='524' similarity=1.0>\n",
      "<Record id1='428' id2='427' similarity=1.0>\n",
      "<Record id1='428' id2='436' similarity=1.0>\n",
      "<Record id1='428' id2='437' similarity=1.0>\n",
      "<Record id1='729' id2='238' similarity=1.0>\n",
      "<Record id1='729' id2='226' similarity=1.0>\n",
      "<Record id1='729' id2='701' similarity=1.0>\n",
      "<Record id1='729' id2='557' similarity=1.0>\n",
      "<Record id1='729' id2='742' similarity=1.0>\n",
      "<Record id1='729' id2='552' similarity=1.0>\n",
      "<Record id1='729' id2='651' similarity=1.0>\n",
      "<Record id1='729' id2='681' similarity=1.0>\n",
      "<Record id1='729' id2='235' similarity=1.0>\n",
      "<Record id1='729' id2='690' similarity=1.0>\n",
      "<Record id1='426' id2='439' similarity=1.0>\n",
      "<Record id1='426' id2='434' similarity=1.0>\n",
      "<Record id1='426' id2='438' similarity=1.0>\n",
      "<Record id1='426' id2='435' similarity=1.0>\n",
      "<Record id1='426' id2='407' similarity=1.0>\n",
      "<Record id1='426' id2='428' similarity=1.0>\n",
      "<Record id1='426' id2='524' similarity=1.0>\n",
      "<Record id1='426' id2='427' similarity=1.0>\n",
      "<Record id1='426' id2='436' similarity=1.0>\n",
      "<Record id1='426' id2='437' similarity=1.0>\n",
      "<Record id1='679' id2='238' similarity=1.0>\n",
      "<Record id1='679' id2='226' similarity=1.0>\n",
      "<Record id1='679' id2='701' similarity=1.0>\n",
      "<Record id1='679' id2='557' similarity=1.0>\n",
      "<Record id1='679' id2='742' similarity=1.0>\n",
      "<Record id1='679' id2='552' similarity=1.0>\n",
      "<Record id1='679' id2='651' similarity=1.0>\n",
      "<Record id1='679' id2='681' similarity=1.0>\n",
      "<Record id1='679' id2='235' similarity=1.0>\n",
      "<Record id1='679' id2='690' similarity=1.0>\n",
      "<Record id1='703' id2='238' similarity=1.0>\n",
      "<Record id1='703' id2='226' similarity=1.0>\n",
      "<Record id1='703' id2='701' similarity=1.0>\n",
      "<Record id1='703' id2='557' similarity=1.0>\n",
      "<Record id1='703' id2='742' similarity=1.0>\n",
      "<Record id1='703' id2='552' similarity=1.0>\n",
      "<Record id1='703' id2='651' similarity=1.0>\n",
      "<Record id1='703' id2='681' similarity=1.0>\n",
      "<Record id1='703' id2='235' similarity=1.0>\n",
      "<Record id1='703' id2='690' similarity=1.0>\n",
      "<Record id1='236' id2='238' similarity=1.0>\n",
      "<Record id1='236' id2='226' similarity=1.0>\n",
      "<Record id1='236' id2='701' similarity=1.0>\n",
      "<Record id1='236' id2='557' similarity=1.0>\n",
      "<Record id1='236' id2='742' similarity=1.0>\n",
      "<Record id1='236' id2='552' similarity=1.0>\n",
      "<Record id1='236' id2='651' similarity=1.0>\n",
      "<Record id1='236' id2='681' similarity=1.0>\n",
      "<Record id1='236' id2='235' similarity=1.0>\n",
      "<Record id1='236' id2='690' similarity=1.0>\n",
      "<Record id1='435' id2='439' similarity=1.0>\n",
      "<Record id1='435' id2='434' similarity=1.0>\n",
      "<Record id1='435' id2='438' similarity=1.0>\n",
      "<Record id1='435' id2='426' similarity=1.0>\n",
      "<Record id1='435' id2='407' similarity=1.0>\n",
      "<Record id1='435' id2='428' similarity=1.0>\n",
      "<Record id1='435' id2='524' similarity=1.0>\n",
      "<Record id1='435' id2='427' similarity=1.0>\n",
      "<Record id1='435' id2='436' similarity=1.0>\n",
      "<Record id1='435' id2='437' similarity=1.0>\n",
      "<Record id1='682' id2='238' similarity=1.0>\n",
      "<Record id1='682' id2='226' similarity=1.0>\n",
      "<Record id1='682' id2='701' similarity=1.0>\n",
      "<Record id1='682' id2='557' similarity=1.0>\n",
      "<Record id1='682' id2='742' similarity=1.0>\n",
      "<Record id1='682' id2='552' similarity=1.0>\n",
      "<Record id1='682' id2='651' similarity=1.0>\n",
      "<Record id1='682' id2='681' similarity=1.0>\n",
      "<Record id1='682' id2='235' similarity=1.0>\n",
      "<Record id1='682' id2='690' similarity=1.0>\n",
      "<Record id1='237' id2='238' similarity=1.0>\n",
      "<Record id1='237' id2='226' similarity=1.0>\n",
      "<Record id1='237' id2='701' similarity=1.0>\n",
      "<Record id1='237' id2='557' similarity=1.0>\n",
      "<Record id1='237' id2='742' similarity=1.0>\n",
      "<Record id1='237' id2='552' similarity=1.0>\n",
      "<Record id1='237' id2='651' similarity=1.0>\n",
      "<Record id1='237' id2='681' similarity=1.0>\n",
      "<Record id1='237' id2='235' similarity=1.0>\n",
      "<Record id1='237' id2='690' similarity=1.0>\n",
      "<Record id1='595' id2='238' similarity=1.0>\n",
      "<Record id1='595' id2='226' similarity=1.0>\n",
      "<Record id1='595' id2='701' similarity=1.0>\n",
      "<Record id1='595' id2='557' similarity=1.0>\n",
      "<Record id1='595' id2='742' similarity=1.0>\n",
      "<Record id1='595' id2='552' similarity=1.0>\n",
      "<Record id1='595' id2='651' similarity=1.0>\n",
      "<Record id1='595' id2='681' similarity=1.0>\n",
      "<Record id1='595' id2='235' similarity=1.0>\n",
      "<Record id1='595' id2='690' similarity=1.0>\n",
      "<Record id1='704' id2='238' similarity=1.0>\n",
      "<Record id1='704' id2='226' similarity=1.0>\n",
      "<Record id1='704' id2='701' similarity=1.0>\n",
      "<Record id1='704' id2='557' similarity=1.0>\n",
      "<Record id1='704' id2='742' similarity=1.0>\n",
      "<Record id1='704' id2='552' similarity=1.0>\n",
      "<Record id1='704' id2='651' similarity=1.0>\n",
      "<Record id1='704' id2='681' similarity=1.0>\n",
      "<Record id1='704' id2='235' similarity=1.0>\n",
      "<Record id1='704' id2='690' similarity=1.0>\n",
      "<Record id1='228' id2='485' similarity=1.0>\n",
      "<Record id1='228' id2='472' similarity=1.0>\n",
      "<Record id1='228' id2='229' similarity=1.0>\n",
      "<Record id1='228' id2='275' similarity=1.0>\n",
      "<Record id1='228' id2='351' similarity=1.0>\n",
      "<Record id1='228' id2='357' similarity=1.0>\n",
      "<Record id1='228' id2='474' similarity=1.0>\n",
      "<Record id1='556' id2='238' similarity=1.0>\n",
      "<Record id1='556' id2='226' similarity=1.0>\n",
      "<Record id1='556' id2='701' similarity=1.0>\n",
      "<Record id1='556' id2='557' similarity=1.0>\n",
      "<Record id1='556' id2='742' similarity=1.0>\n",
      "<Record id1='556' id2='552' similarity=1.0>\n",
      "<Record id1='556' id2='651' similarity=1.0>\n",
      "<Record id1='556' id2='681' similarity=1.0>\n",
      "<Record id1='556' id2='235' similarity=1.0>\n",
      "<Record id1='556' id2='690' similarity=1.0>\n",
      "<Record id1='229' id2='485' similarity=1.0>\n",
      "<Record id1='229' id2='472' similarity=1.0>\n",
      "<Record id1='229' id2='228' similarity=1.0>\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record id1='229' id2='275' similarity=1.0>\n",
      "<Record id1='229' id2='351' similarity=1.0>\n",
      "<Record id1='229' id2='357' similarity=1.0>\n",
      "<Record id1='229' id2='474' similarity=1.0>\n",
      "<Record id1='407' id2='439' similarity=1.0>\n",
      "<Record id1='407' id2='434' similarity=1.0>\n",
      "<Record id1='407' id2='438' similarity=1.0>\n",
      "<Record id1='407' id2='426' similarity=1.0>\n",
      "<Record id1='407' id2='435' similarity=1.0>\n",
      "<Record id1='407' id2='428' similarity=1.0>\n",
      "<Record id1='407' id2='524' similarity=1.0>\n",
      "<Record id1='407' id2='427' similarity=1.0>\n",
      "<Record id1='407' id2='436' similarity=1.0>\n",
      "<Record id1='407' id2='437' similarity=1.0>\n",
      "<Record id1='269' id2='238' similarity=1.0>\n",
      "<Record id1='269' id2='226' similarity=1.0>\n",
      "<Record id1='269' id2='701' similarity=1.0>\n",
      "<Record id1='269' id2='557' similarity=1.0>\n",
      "<Record id1='269' id2='742' similarity=1.0>\n",
      "<Record id1='269' id2='552' similarity=1.0>\n",
      "<Record id1='269' id2='651' similarity=1.0>\n",
      "<Record id1='269' id2='681' similarity=1.0>\n",
      "<Record id1='269' id2='235' similarity=1.0>\n",
      "<Record id1='269' id2='690' similarity=1.0>\n",
      "<Record id1='350' id2='359' similarity=1.0>\n",
      "<Record id1='350' id2='490' similarity=1.0>\n",
      "<Record id1='490' id2='359' similarity=1.0>\n",
      "<Record id1='490' id2='350' similarity=1.0>\n",
      "<Record id1='359' id2='490' similarity=1.0>\n",
      "<Record id1='359' id2='350' similarity=1.0>\n",
      "<Record id1='156' id2='152' similarity=1.0>\n",
      "<Record id1='152' id2='156' similarity=1.0>\n",
      "<Record id1='157' id2='164' similarity=1.0>\n",
      "<Record id1='164' id2='157' similarity=1.0>\n",
      "<Record id1='161' id2='158' similarity=1.0>\n",
      "<Record id1='158' id2='161' similarity=1.0>\n",
      "<Record id1='159' id2='162' similarity=1.0>\n",
      "<Record id1='162' id2='159' similarity=1.0>\n",
      "<Record id1='160' id2='163' similarity=1.0>\n",
      "<Record id1='163' id2='160' similarity=1.0>\n",
      "<Record id1='306' id2='533' similarity=1.0>\n",
      "<Record id1='306' id2='165' similarity=1.0>\n",
      "<Record id1='165' id2='533' similarity=1.0>\n",
      "<Record id1='165' id2='306' similarity=1.0>\n",
      "<Record id1='533' id2='165' similarity=1.0>\n",
      "<Record id1='533' id2='306' similarity=1.0>\n",
      "<Record id1='308' id2='166' similarity=1.0>\n",
      "<Record id1='308' id2='535' similarity=1.0>\n",
      "<Record id1='535' id2='166' similarity=1.0>\n",
      "<Record id1='535' id2='308' similarity=1.0>\n",
      "<Record id1='166' id2='535' similarity=1.0>\n",
      "<Record id1='166' id2='308' similarity=1.0>\n",
      "<Record id1='169' id2='307' similarity=1.0>\n",
      "<Record id1='169' id2='534' similarity=1.0>\n",
      "<Record id1='534' id2='307' similarity=1.0>\n",
      "<Record id1='534' id2='169' similarity=1.0>\n",
      "<Record id1='307' id2='534' similarity=1.0>\n",
      "<Record id1='307' id2='169' similarity=1.0>\n",
      "<Record id1='310' id2='167' similarity=1.0>\n",
      "<Record id1='310' id2='537' similarity=1.0>\n",
      "<Record id1='537' id2='167' similarity=1.0>\n",
      "<Record id1='537' id2='310' similarity=1.0>\n",
      "<Record id1='167' id2='537' similarity=1.0>\n",
      "<Record id1='167' id2='310' similarity=1.0>\n",
      "<Record id1='309' id2='536' similarity=1.0>\n",
      "<Record id1='309' id2='168' similarity=1.0>\n",
      "<Record id1='168' id2='536' similarity=1.0>\n",
      "<Record id1='168' id2='309' similarity=1.0>\n",
      "<Record id1='536' id2='168' similarity=1.0>\n",
      "<Record id1='536' id2='309' similarity=1.0>\n",
      "<Record id1='208' id2='210' similarity=1.0>\n",
      "<Record id1='208' id2='206' similarity=1.0>\n",
      "<Record id1='206' id2='210' similarity=1.0>\n",
      "<Record id1='206' id2='208' similarity=1.0>\n",
      "<Record id1='210' id2='206' similarity=1.0>\n",
      "<Record id1='210' id2='208' similarity=1.0>\n",
      "<Record id1='232' id2='231' similarity=1.0>\n",
      "<Record id1='231' id2='232' similarity=1.0>\n",
      "<Record id1='247' id2='248' similarity=1.0>\n",
      "<Record id1='248' id2='247' similarity=1.0>\n",
      "<Record id1='260' id2='261' similarity=1.0>\n",
      "<Record id1='261' id2='260' similarity=1.0>\n",
      "<Record id1='549' id2='267' similarity=1.0>\n",
      "<Record id1='267' id2='549' similarity=1.0>\n",
      "<Record id1='743' id2='268' similarity=1.0>\n",
      "<Record id1='268' id2='743' similarity=1.0>\n",
      "<Record id1='626' id2='625' similarity=1.0>\n",
      "<Record id1='625' id2='626' similarity=1.0>\n",
      "<Record id1='452' id2='480' similarity=1.0>\n",
      "<Record id1='480' id2='452' similarity=1.0>\n",
      "<Record id1='433' id2='454' similarity=1.0>\n",
      "<Record id1='433' id2='432' similarity=1.0>\n",
      "<Record id1='432' id2='454' similarity=1.0>\n",
      "<Record id1='432' id2='433' similarity=1.0>\n",
      "<Record id1='620' id2='621' similarity=1.0>\n",
      "<Record id1='454' id2='432' similarity=1.0>\n",
      "<Record id1='454' id2='433' similarity=1.0>\n",
      "<Record id1='621' id2='620' similarity=1.0>\n",
      "<Record id1='479' id2='451' similarity=1.0>\n",
      "<Record id1='451' id2='479' similarity=1.0>\n",
      "<Record id1='560' id2='559' similarity=1.0>\n",
      "<Record id1='559' id2='560' similarity=1.0>\n",
      "<Record id1='623' id2='622' similarity=1.0>\n",
      "<Record id1='622' id2='623' similarity=1.0>\n"
     ]
    },
    {
     "ename": "FileNotFoundError",
     "evalue": "[Errno 2] No such file or directory: '..\\\\Data/csvs/basal_ganglia/regions/analysis_similarity_rat.csv'",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mFileNotFoundError\u001b[0m                         Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-19-9f5c7d263868>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[0;32m     25\u001b[0m     \u001b[0msimilairty_df\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mto_csv\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"..\\Data/csvs/basal_ganglia/regions/analysis_similarity_%s.csv\"\u001b[0m \u001b[1;33m%\u001b[0m \u001b[1;33m(\u001b[0m\u001b[1;34m\"rat\"\u001b[0m \u001b[1;32mif\u001b[0m \u001b[0mspecie_id\u001b[0m \u001b[1;33m==\u001b[0m \u001b[1;36m1\u001b[0m \u001b[1;32melse\u001b[0m \u001b[1;34m\"mouse\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mindex\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;36m1\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     26\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 27\u001b[1;33m \u001b[0mrun_similarity_store_database_and_csv\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;36m1\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     28\u001b[0m \u001b[0mrun_similarity_store_database_and_csv\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;36m2\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m<ipython-input-19-9f5c7d263868>\u001b[0m in \u001b[0;36mrun_similarity_store_database_and_csv\u001b[1;34m(specie_id)\u001b[0m\n\u001b[0;32m     23\u001b[0m     \u001b[1;31m# Stores the result in a CSV file for the genereal database import\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     24\u001b[0m     \u001b[0msimilairty_df\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mpd\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mDataFrame\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0msimilarity_rows\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mcolumns\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;33m[\u001b[0m\u001b[1;34m\"id1\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;34m\"id2\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;34m\"score\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 25\u001b[1;33m     \u001b[0msimilairty_df\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mto_csv\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"..\\Data/csvs/basal_ganglia/regions/analysis_similarity_%s.csv\"\u001b[0m \u001b[1;33m%\u001b[0m \u001b[1;33m(\u001b[0m\u001b[1;34m\"rat\"\u001b[0m \u001b[1;32mif\u001b[0m \u001b[0mspecie_id\u001b[0m \u001b[1;33m==\u001b[0m \u001b[1;36m1\u001b[0m \u001b[1;32melse\u001b[0m \u001b[1;34m\"mouse\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mindex\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;36m1\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     26\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     27\u001b[0m \u001b[0mrun_similarity_store_database_and_csv\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;36m1\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\AppData\\Roaming\\Python\\Python37\\site-packages\\pandas\\core\\generic.py\u001b[0m in \u001b[0;36mto_csv\u001b[1;34m(self, path_or_buf, sep, na_rep, float_format, columns, header, index, index_label, mode, encoding, compression, quoting, quotechar, line_terminator, chunksize, date_format, doublequote, escapechar, decimal, errors)\u001b[0m\n\u001b[0;32m   3165\u001b[0m             \u001b[0mdecimal\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mdecimal\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   3166\u001b[0m         )\n\u001b[1;32m-> 3167\u001b[1;33m         \u001b[0mformatter\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0msave\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m   3168\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   3169\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mpath_or_buf\u001b[0m \u001b[1;32mis\u001b[0m \u001b[1;32mNone\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\AppData\\Roaming\\Python\\Python37\\site-packages\\pandas\\io\\formats\\csvs.py\u001b[0m in \u001b[0;36msave\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    188\u001b[0m                 \u001b[0mencoding\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mencoding\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    189\u001b[0m                 \u001b[0merrors\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0merrors\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 190\u001b[1;33m                 \u001b[0mcompression\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mdict\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mcompression_args\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mmethod\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mcompression\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    191\u001b[0m             )\n\u001b[0;32m    192\u001b[0m             \u001b[0mclose\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;32mTrue\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\AppData\\Roaming\\Python\\Python37\\site-packages\\pandas\\io\\common.py\u001b[0m in \u001b[0;36mget_handle\u001b[1;34m(path_or_buf, mode, encoding, compression, memory_map, is_text, errors)\u001b[0m\n\u001b[0;32m    491\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mencoding\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    492\u001b[0m             \u001b[1;31m# Encoding\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 493\u001b[1;33m             \u001b[0mf\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mopen\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mpath_or_buf\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mmode\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mencoding\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mencoding\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0merrors\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0merrors\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mnewline\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;34m\"\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    494\u001b[0m         \u001b[1;32melif\u001b[0m \u001b[0mis_text\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    495\u001b[0m             \u001b[1;31m# No explicit encoding\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mFileNotFoundError\u001b[0m: [Errno 2] No such file or directory: '..\\\\Data/csvs/basal_ganglia/regions/analysis_similarity_rat.csv'"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "def run_similarity_store_database_and_csv(specie_id):\n",
    "    similarity_rows = []\n",
    "    projection = \"analyses-rat\" if specie_id == 1 else \"analyses-mouse\"\n",
    "    with driver.session() as session:\n",
    "        res = session.run(\"\"\"\n",
    "            CALL gds.nodeSimilarity.stream(\n",
    "                '%s',\n",
    "                {\n",
    "                    degreeCutoff: 3,\n",
    "                    similarityCutoff: 1.0\n",
    "                }\n",
    "            )\n",
    "            YIELD node1, node2, similarity\n",
    "            RETURN gds.util.asNode(node1).id as id1, gds.util.asNode(node2).id as id2, similarity\n",
    "        \"\"\" % projection)\n",
    "        for record in res:\n",
    "            similarity_rows.append([record[\"id1\"], record[\"id1\"], record[\"similarity\"]])\n",
    "\n",
    "\n",
    "    # Stores the result in a CSV file for the genereal database import\n",
    "    similairty_df = pd.DataFrame(similarity_rows, columns = [\"id1\", \"id2\", \"score\"])\n",
    "    similairty_df.to_csv(\"..\\Data/csvs/basal_ganglia/regions/analysis_similarity_%s.csv\" % (\"rat\" if specie_id == 1 else \"mouse\"), index=1)    \n",
    "\n",
    "run_similarity_store_database_and_csv(1)\n",
    "run_similarity_store_database_and_csv(2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Clean-up\n",
    "We remove the projected graph, and delete the created relationship `SIMILARITY_ALGORITHM`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"call gds.graph.drop('analyses-rat')\")\n",
    "    session.run(\"call gds.graph.drop('analyses-mouse')\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-[r:SIMILARITY_ALGORITHM]->()\n",
    "        DELETE r\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to read from defunct connection Address(host='100.26.227.192', port=34124) (Address(host='100.26.227.192', port=34124))\n"
     ]
    },
    {
     "ename": "ServiceUnavailable",
     "evalue": "Failed to read from defunct connection Address(host='100.26.227.192', port=34124) (Address(host='100.26.227.192', port=34124))",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mServiceUnavailable\u001b[0m                        Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-4-9b5f2320462b>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[0;32m      4\u001b[0m       \u001b[0mMATCH\u001b[0m \u001b[1;33m(\u001b[0m\u001b[0mn\u001b[0m\u001b[1;33m:\u001b[0m\u001b[0mAnalysis\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m-\u001b[0m\u001b[1;33m->\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m:\u001b[0m\u001b[0mReporterIncubation\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m-\u001b[0m\u001b[1;33m->\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mr\u001b[0m\u001b[1;33m:\u001b[0m\u001b[0mReporter\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      5\u001b[0m       \u001b[0mMERGE\u001b[0m \u001b[1;33m(\u001b[0m\u001b[0mn\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m-\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;33m:\u001b[0m\u001b[0mANA_DATA\u001b[0m \u001b[1;33m{\u001b[0m\u001b[0mstrength\u001b[0m\u001b[1;33m:\u001b[0m \u001b[1;36m1\u001b[0m\u001b[1;33m}\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m->\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mr\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 6\u001b[1;33m   \"\"\")\n\u001b[0m\u001b[0;32m      7\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      8\u001b[0m   session.run(\"\"\"\n",
      "\u001b[1;32mc:\\users\\maren.gulnes\\appdata\\local\\programs\\python\\python37\\lib\\site-packages\\neo4j\\__init__.py\u001b[0m in \u001b[0;36mrun\u001b[1;34m(self, statement, parameters, **kwparameters)\u001b[0m\n\u001b[0;32m    501\u001b[0m             \u001b[1;32mtry\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    502\u001b[0m                 \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0msend\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 503\u001b[1;33m                 \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mfetch\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    504\u001b[0m             \u001b[1;32mexcept\u001b[0m \u001b[0mConnectionExpired\u001b[0m \u001b[1;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    505\u001b[0m                 \u001b[1;32mraise\u001b[0m \u001b[0mSessionExpired\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m*\u001b[0m\u001b[0merror\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0margs\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\users\\maren.gulnes\\appdata\\local\\programs\\python\\python37\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36mfetch\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    420\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0mfetch\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    421\u001b[0m         \u001b[1;32mtry\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 422\u001b[1;33m             \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_fetch\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    423\u001b[0m         \u001b[1;32mexcept\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mknown_errors\u001b[0m \u001b[1;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    424\u001b[0m             \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0merror_handler\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mhandle\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0merror\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0munresolved_address\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\users\\maren.gulnes\\appdata\\local\\programs\\python\\python37\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36m_fetch\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    441\u001b[0m             \u001b[1;32mreturn\u001b[0m \u001b[1;36m0\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;36m0\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    442\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 443\u001b[1;33m         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_receive\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    444\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    445\u001b[0m         \u001b[0mdetails\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0msummary_metadata\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_unpack\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\users\\maren.gulnes\\appdata\\local\\programs\\python\\python37\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36m_receive\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    489\u001b[0m                 \u001b[1;32mif\u001b[0m \u001b[0misinstance\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mresponse\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mCommitResponse\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    490\u001b[0m                     \u001b[1;32mraise\u001b[0m \u001b[0mIncompleteCommitError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 491\u001b[1;33m             \u001b[1;32mraise\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    492\u001b[0m         \u001b[1;32melif\u001b[0m \u001b[0mreceived\u001b[0m \u001b[1;33m==\u001b[0m \u001b[1;33m-\u001b[0m\u001b[1;36m1\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    493\u001b[0m             \u001b[1;32mraise\u001b[0m \u001b[0mKeyboardInterrupt\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mServiceUnavailable\u001b[0m: Failed to read from defunct connection Address(host='100.26.227.192', port=34124) (Address(host='100.26.227.192', port=34124))"
     ]
    }
   ],
   "source": [
    "  ### MATCH All these for part 2 (looking at method differences)\n",
    "with driver.session() as session:   \n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:ReporterIncubation)-->(r:Reporter)\n",
    "        MERGE (n)-[:ANA_DATA {strength: 1}]->(r)\n",
    "    \"\"\")\n",
    "  \n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(:RegionRecord)-->(b:BrainRegion)\n",
    "        MERGE (n)-[:ANA_DATA {strength: 1}]->(b)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(r:CellularRegion)\n",
    "        MERGE (n)-[:ANA_DATA {strength: 1}]->(r)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Experiment)-[:ANAESTHETIC]->(r:Solution)\n",
    "        MERGE (n)-[:ANESTHETIC]->(r)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Experiment)-[:PERFUSION_FIX_MEDIUM]->(r:Solution)\n",
    "        MERGE (n)-[:PERFUSION]->(r)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Experiment)-->(:Specimen)-->(s:Specie)\n",
    "        MERGE (n)-[:ANA_DATA]->(s)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(s:Software)\n",
    "        MERGE (n)-[:ANA_DATA]->(s)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(s:RegionZone)\n",
    "        MERGE (n)-[:ANA_DATA]->(s)\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Get \"real\" analysis similarity\n",
    "# This is ONLY to see if we find anything interesting.\n",
    "# The \"real\" similarities will be set on the website\n",
    "# the \"_all.csv\" are based on Reporter, CellTYpe and BrainRegion only\n",
    "import pandas as pd\n",
    "\n",
    "df = pd.read_csv(\"Data/csvs/graph/analyses_similarity_mouse_all.csv\")\n",
    "\n",
    "new_table = []\n",
    "for index, row in df.iterrows():\n",
    "    if(pd.isnull(row[\"id1\"])):\n",
    "        continue\n",
    "    \n",
    "    name1 = row[\"analysis1\"].split(\"_\")[:2]\n",
    "    name2 = row[\"analysis2\"].split(\"_\")[:2]\n",
    "    if(name1 != name2 and float(row[\"similarity\"] > 0.5)):\n",
    "        new_table.append([row[\"id1\"], row[\"id2\"], row[\"analysis1\"], row[\"analysis2\"], row[\"similarity\"]])\n",
    "\n",
    "# remove duplicated\n",
    "for row1 in new_table:\n",
    "    for row2 in new_table:\n",
    "        if(row1[0] == row2[0] and row1[1] == row2[1] and row1[4] == row2[4]):\n",
    "            new_table.remove(row2)\n",
    "            \n",
    "        \n",
    "new_df =  pd.DataFrame(new_table, columns=[\"id1\", \"id2\", \"analysis1\", \"analysis2\", \"similarity\"])\n",
    "new_df.to_csv(\"Data/csvs/graph/reffined_analyses_similarity_mouse_all.csv\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8 11\n",
      "88 \n",
      "        MATCH (c:CellType)<-[:CELL_TYPE_PUTATIVE]-(n:Analysis)-[:DATA_TYPE]->(:Quantitation)-[:REGION_RECORD]->(:RegionRecord)-[:PRIMARY_REGION]->(b:BrainRegion)\n",
      "        WHERE c.id =\"8\" AND b.id = \"1\"\n",
      "        return COUNT(DISTINCT n.id) as analysisCount, c.id, c.name, b.id, b.name\n",
      "        \n",
      "        \n",
      ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 72 14 Tyrosine hydroxylase expressing 10 Pars compacta\n",
      ". . . . . 25 14 Tyrosine hydroxylase expressing 26 Substantia nigra\n",
      ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 37 42 Neuron 1 Caudoputamen\n",
      ". 29 42 Neuron 2 Caudoputamen\n",
      ". . . . 27 42 Neuron 10 Pars compacta\n",
      ". . . . . [(72, '14', 'Tyrosine hydroxylase expressing', '10', 'Pars compacta'), (25, '14', 'Tyrosine hydroxylase expressing', '26', 'Substantia nigra'), (37, '42', 'Neuron', '1', 'Caudoputamen'), (29, '42', 'Neuron', '2', 'Caudoputamen'), (27, '42', 'Neuron', '10', 'Pars compacta')]\n"
     ]
    }
   ],
   "source": [
    "## Is there somehting in the methods used that make a difference in the results?\n",
    "\n",
    "cell_ids = []\n",
    "region_ids = []\n",
    "\n",
    "with driver.session() as session:    \n",
    "    res = session.run(\"\"\"\n",
    "        Match (b:BrainRegion)\n",
    "        WHERE size((:Analysis)-[:DATA_TYPE]->(:Quantitation)-[:REGION_RECORD]->(:RegionRecord)-[:PRIMARY_REGION]->(b)) >=20\n",
    "        return b.id\n",
    "    \n",
    "    \"\"\")\n",
    "    for record in res:\n",
    "        region_ids.append(record[\"b.id\"])\n",
    "    res = session.run(\"\"\"\n",
    "        Match (c:CellType)\n",
    "        WHERE size((c)<-[:CELL_TYPE_PUTATIVE]-(:Analysis)) >=20\n",
    "        return c.id\n",
    "    \"\"\")\n",
    "    for record in res:\n",
    "        cell_ids.append(record[\"c.id\"])\n",
    "\n",
    "print(len(cell_ids), len(region_ids))\n",
    "queries = []\n",
    "        \n",
    "for cell_id in cell_ids:\n",
    "    for region_id in region_ids:\n",
    "        q = \"\"\"\n",
    "        MATCH (c:CellType)<-[:CELL_TYPE_PUTATIVE]-(n:Analysis)-[:DATA_TYPE]->(:Quantitation)-[:REGION_RECORD]->(:RegionRecord)-[:PRIMARY_REGION]->(b:BrainRegion)\n",
    "        WHERE c.id =\"%s\" AND b.id = \"%s\"\n",
    "        return COUNT(DISTINCT n.id) as analysisCount, c.id, c.name, b.id, b.name\n",
    "        \n",
    "        \"\"\" % (cell_id, region_id)\n",
    "        queries.append(q)\n",
    "        \n",
    "print(len(queries), queries[0])\n",
    "results = []\n",
    "for query in queries:\n",
    "    with driver.session() as session:  \n",
    "        print(\".\", end =\" \")\n",
    "        res = session.run(query)\n",
    "        for rec in res:\n",
    "            if(rec[\"analysisCount\"] > 20):\n",
    "                print(rec[\"analysisCount\"], rec[\"c.id\"], rec[\"c.name\"], rec[\"b.id\"], rec[\"b.name\"])\n",
    "                results.append((rec[\"analysisCount\"], rec[\"c.id\"], rec[\"c.name\"], rec[\"b.id\"], rec[\"b.name\"]))\n",
    "            \n",
    "print(results)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "results = [\n",
    "    (72, '14', 'Tyrosine hydroxylase expressing', '10', 'Pars compacta'), \n",
    "    (25, '14', 'Tyrosine hydroxylase expressing', '26', 'Substantia nigra'), \n",
    "    (37, '42', 'Neuron', '1', 'Caudoputamen'), \n",
    "    (29, '42', 'Neuron', '2', 'Caudoputamen'), \n",
    "    (27, '42', 'Neuron', '10', 'Pars compacta')\n",
    "]\n",
    "\n",
    "analyses_groups = []\n",
    "\n",
    "with driver.session() as session:    \n",
    "    for res in results:\n",
    "        _, cellId, _, regId, _ = res\n",
    "        ## I'M Making these into subgraphs in neo3j directly instead and perform node similarity, as it's only really two..\n",
    "        analyses_query = \"\"\"\n",
    "        MATCH (a:Analysis)-->(r:Reporter)\n",
    "        MATCH (a)-->(s:Strain)\n",
    "        MATCH (a)-->(v:VisualizationProtocol)\n",
    "        MATCH (a)-->(soft:Software)\n",
    "        MATCH (a)-->()-->(m:Microscope)\n",
    "        MATCH (a)-[:PERFUSION]->(perf:Solution)\n",
    "        MATCH (a)-[:ANESTHETIC]->(ane:Solution)\n",
    "        WHERE (a)-->(:CellType {id: \"%s\"}) AND (a)-->(:BrainRegion {id: \"%s\"})\n",
    "        RETURN a.id, a.name, s.name, r.name\n",
    "        \"\"\" % (cellId, regId)\n",
    "        neo_res = session.run(query)\n",
    "        ana = []\n",
    "        for rec in neo_res:\n",
    "            ana.push((rec[\"a.id\"], rec[a.name])\n",
    "        analyses_groups.push(ana)\n",
    "                     \n",
    "\n",
    "for group in analyses_groups:\n",
    "    \n",
    "    \n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Graph for networkx\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "neo4jUser = os.getenv(\"NEO4J_USER\")\n",
    "neo4jPwd = os.getenv(\"NEO4J_PASSWORD\")\n",
    "neo4jUrl = os.getenv(\"NEO4j_BOLT\")\n",
    "\n",
    "driver = GraphDatabase.driver(neo4jUrl,auth=basic_auth(neo4jUser, neo4jPwd))\n",
    "\n",
    "  ### MATCH All these for part 2 (looking at method differences)\n",
    "with driver.session() as session:   \n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(i:ReporterIncubation)-->(r:Reporter)\n",
    "        MERGE (n)-[:ANA_DATA:USED {weight: 1, type: i.Order}]->(r)\n",
    "    \"\"\")\n",
    "  \n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(:RegionRecord)-[:PRIMARY_REGION]->(b:BrainRegion)\n",
    "        MERGE (n)-[:ANA_DATA:OBSERVED_REGION {weight: 1, type: \"primary\"}]->(b)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(:RegionRecord)-[:SECONDARY_REGION]->(b:BrainRegion)\n",
    "        MERGE (n)-[:ANA_DATA:OBSERVED_REGION {weight: 1, type: \"secondary\"}]->(b)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(r:CellularRegion)\n",
    "        MERGE (n)-[:ANA_DATA:CELLULAR_REGION {weight: 1}]->(r)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Experiment)-[:ANAESTHETIC]->(r:Solution)\n",
    "        MERGE (n)-[:ANA_DATA:ANESTHETIC]->(r)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Experiment)-[:PERFUSION_FIX_MEDIUM]->(r:Solution)\n",
    "        MERGE (n)-[:ANA_DATA:PERFUSION]->(r)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Experiment)-->(:Specimen)-->(s:Specie)\n",
    "        MERGE (n)-[:ANA_DATA]->(s)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(s:Software)\n",
    "        MERGE (n)-[:ANA_DATA]->(s)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(s:RegionZone)\n",
    "        MERGE (n)-[:ANA_DATA]->(s)\n",
    "    \"\"\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
