{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Use case: Finding similar analyses based on brain region and cell type\n",
    "\n",
    "This is the code to find all similar analyses that are from the same specie, brain region and cell types.\n",
    "\n",
    "The result is also stored in a csv for use at the website.\n",
    "\n",
    "If you have cloned this project, the generated similarity file is already created and all you need to run is the `1. Create the Rodent Basal Ganglia Graph` notebook on the start page."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, basic_auth\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "neo4jUser = os.getenv(\"NEO4J_USER\")\n",
    "neo4jPwd = os.getenv(\"NEO4J_PASSWORD\")\n",
    "neo4jUrl = os.getenv(\"NEO4j_BOLT\")\n",
    "\n",
    "driver = GraphDatabase.driver(neo4jUrl,auth=basic_auth(neo4jUser, neo4jPwd), encrypted=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create the graph projection\n",
    "\n",
    "Create a projection of analyses connected with brain region and cell type, per specie\n",
    "\n",
    "For simplicity, we first add a special named relationship between the analyzes and brain region, cell type and specie.\n",
    "This relationship is cleaned up after the algorithm is complete."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(:RegionRecord)-[:PRIMARY_REGION]->(b:BrainRegion)\n",
    "        MERGE (n)-[:NODE_SIMILARITY]->(b)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(c:CellType)\n",
    "        MERGE (n)-[:NODE_SIMILARITY]->(c)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Specimen)-->(s:Specie)\n",
    "        MERGE (n)-[:NODE_SIMILARITY]->(s)\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(s:NeuralStructure)\n",
    "        MERGE (n)-[:NODE_SIMILARITY]->(s)\n",
    "    \"\"\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created projection of 875 nodes\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run(\"\"\"\n",
    "        CALL gds.graph.create(\n",
    "            'analyses', \n",
    "            [\"CellType\", \"BrainRegion\", \"Specie\", \"Analysis\", \"NeuralStructure\"], \n",
    "            'NODE_SIMILARITY'\n",
    "        )\n",
    "    \"\"\")\n",
    "    for rec in res:\n",
    "        print(\"Created projection of\", rec[\"nodeCount\"], \"nodes\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Run the similarity algorithm and store the results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Analyses\n",
    "\n",
    "Runs node similarity on the projection `analyses` and stores the result in `Data/csvs/basal_ganglia/regions/analysis_similarity.csv`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id1</th>\n",
       "      <th>id2</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>101</td>\n",
       "      <td>550</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>101</td>\n",
       "      <td>593</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>101</td>\n",
       "      <td>498</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>101</td>\n",
       "      <td>102</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>102</td>\n",
       "      <td>550</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3421</th>\n",
       "      <td>91</td>\n",
       "      <td>292</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3422</th>\n",
       "      <td>91</td>\n",
       "      <td>290</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3423</th>\n",
       "      <td>91</td>\n",
       "      <td>288</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3424</th>\n",
       "      <td>91</td>\n",
       "      <td>78</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3425</th>\n",
       "      <td>91</td>\n",
       "      <td>77</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3426 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      id1  id2  score\n",
       "0     101  550    1.0\n",
       "1     101  593    1.0\n",
       "2     101  498    1.0\n",
       "3     101  102    1.0\n",
       "4     102  550    1.0\n",
       "...   ...  ...    ...\n",
       "3421   91  292    1.0\n",
       "3422   91  290    1.0\n",
       "3423   91  288    1.0\n",
       "3424   91   78    1.0\n",
       "3425   91   77    1.0\n",
       "\n",
       "[3426 rows x 3 columns]"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "similarity_rows = []\n",
    "with driver.session() as session:\n",
    "    res = session.run(\"\"\"\n",
    "        CALL gds.nodeSimilarity.stream(\n",
    "            'analyses',\n",
    "            {\n",
    "                degreeCutoff: 3,\n",
    "                similarityCutoff: 1.0\n",
    "            }\n",
    "        )\n",
    "        YIELD node1, node2, similarity\n",
    "        RETURN gds.util.asNode(node1).id as id1, gds.util.asNode(node2).id as id2, similarity\n",
    "        ORDER BY id1\n",
    "    \"\"\")\n",
    "    for record in res:\n",
    "        similarity_rows.append([record[\"id1\"], record[\"id2\"], record[\"similarity\"]])\n",
    "\n",
    "\n",
    "    \n",
    "pd.DataFrame(similarity_rows, columns = [\"id1\", \"id2\", \"score\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "517 unique analyses connected to 405 distinct analyses\n"
     ]
    }
   ],
   "source": [
    "# Stores the result in a CSV file for the genereal database import\n",
    "_.to_csv(\"..\\Data/csvs/basal_ganglia/regions/analysis_similarity.csv\")\n",
    "_.to_csv(\"..\\Data/csvs/basal_ganglia_valid_ascii/regions/analysis_similarity.csv\")\n",
    "print(_[\"id1\"].nunique(), \"unique analyses connected to\", _[\"id2\"].nunique(), \"distinct analyses\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can also store the relationships in the data base for example for visualization. Below er create the relationship `NODE_ANALYSES_SIMILARITY`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wrote 3426 relationships\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run(\"\"\"\n",
    "        CALL gds.nodeSimilarity.write(\n",
    "          'analyses',\n",
    "          {\n",
    "            degreeCutoff: 4,\n",
    "            similarityCutoff: 1.0,\n",
    "            writeRelationshipType: 'NODE_ANALYSES_SIMILARITY',\n",
    "            writeProperty:'score'\n",
    "          }\n",
    "        )\n",
    "    \"\"\")\n",
    "    for rec in res:\n",
    "        print(\"Wrote\", rec[\"relationshipsWritten\"], \"relationships\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Clean-up\n",
    "We remove the projected graphs, and delete the created relationship `SIMILARITY_ALGORITHM`. The relationship `NODE_ANALYSES_SIMILARITY` will not be deleted until the end."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"call gds.graph.drop('analyses')\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH ()-[r:NODE_SIMILARITY]-()\n",
    "        DETACH DELETE r\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Use case: Can we say anythong about the methods?\n",
    "\n",
    "*Is it possible to say anything about the methods the researchers used in the experiments when counting a cell type in a specific region that correlates to the result?*\n",
    "\n",
    "This part tries to answer the stated question.\n",
    "\n",
    "From the previous step, we have all nodes that have same Object of interest, cell type, specie and brain region connected with the relationship `NODE_ANALYSES_SIMILARITY`.\n",
    "\n",
    "Next we define communities based on this. That will create a community for each Analysis. We write this back into the graph database. Next we add relationships to the methods called `USE_CASE`. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created projection of 499 nodes\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    res = session.run(\"\"\"\n",
    "        CALL gds.graph.create.cypher(\n",
    "            'analyses', \n",
    "            'MATCH (n:Analysis {dataType: \"Quantitation\"})-[:NODE_ANALYSES_SIMILARITY]-() WITH DISTINCT n as nodes UNWIND nodes as x RETURN id(x) as id',\n",
    "            'MATCH (n:Analysis {dataType: \"Quantitation\"})-[:NODE_ANALYSES_SIMILARITY]-(m:Analysis {dataType: \"Quantitation\"}) RETURN id(n) AS source, id(m) AS target'\n",
    "\n",
    "        )\n",
    "    \"\"\")\n",
    "    for rec in res:\n",
    "        print(\"Created projection of\", rec[\"nodeCount\"], \"nodes\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Louvain Id</th>\n",
       "      <th>Size</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>134</td>\n",
       "      <td>72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>208</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>166</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>384</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>265</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>405</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>408</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>447</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>77</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>122</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>90 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Louvain Id  Size\n",
       "0          134    72\n",
       "1          208    26\n",
       "2          166    24\n",
       "3          384    19\n",
       "4          265    16\n",
       "..         ...   ...\n",
       "85         405     2\n",
       "86         408     2\n",
       "87         447     2\n",
       "88          77     1\n",
       "89         122     1\n",
       "\n",
       "[90 rows x 2 columns]"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "louvain_table = []\n",
    "with driver.session() as session:\n",
    "    res = session.run(\"\"\"\n",
    "        CALL gds.louvain.stream('analyses')\n",
    "        YIELD nodeId, communityId\n",
    "        RETURN communityId AS louvainId, COUNT(DISTINCT nodeId) AS members\n",
    "        ORDER BY members DESC\n",
    "    \"\"\")\n",
    "    \n",
    "    for rec in res:\n",
    "        louvain_table.append([rec[\"louvainId\"], rec[\"members\"]])\n",
    "\n",
    "pd.DataFrame(louvain_table, columns=[\"Louvain Id\", \"Size\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"\"\"\n",
    "        CALL gds.louvain.write(\n",
    "          'analyses',\n",
    "          {\n",
    "            writeProperty: 'louvainAnalyses'\n",
    "          }\n",
    "        )\n",
    "    \"\"\")\n",
    "\n",
    "    session.run(\"call gds.graph.drop('analyses')\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In the largest cluster, all nodes are not connected to each other, but because the similarity is transitive, as the similarity cutoff is set to 1.0, this does not matter. The rest of the communities are complete graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    ## data types\n",
    "    #session.run(\"CREATE (:AnalysisDataType {id: 1, name: 'Quantitation'})\")\n",
    "    #session.run(\"CREATE (:AnalysisDataType {id: 2, name: 'Distribution'})\")\n",
    "    #session.run(\"CREATE (:AnalysisDataType {id: 3, name: 'Morphology'})\")\n",
    "    \n",
    "    #session.run(\"\"\"\n",
    "    #    MATCH (n:Analysis)\n",
    "    #    MATCH (m:AnalysisDataType)\n",
    "    #    WHERE n.dataType = m.name\n",
    "    #    MERGE (n)-[:USE_CASE]->(m)\n",
    "    #\"\"\")\n",
    "\n",
    "    ## brain region\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(:RegionRecord)-[:PRIMARY_REGION]->(b:BrainRegion)\n",
    "        MERGE (n)-[:USE_CASE]->(b)\n",
    "    \"\"\")\n",
    "    ## Specie\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:Specimen)-->(s:Specie)\n",
    "        MERGE (n)-[:USE_CASE]->(s)\n",
    "    \"\"\")\n",
    "    ## Microscope\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->()-->(m:Microscope)\n",
    "        MERGE (n)-[:USE_CASE]->(m)\n",
    "    \"\"\")\n",
    "    ## Reporter\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:ReporterIncubation)-->(r:Reporter)\n",
    "        MERGE (n)-[:USE_CASE {strength: 1}]->(r)\n",
    "    \"\"\")\n",
    "    ## CellularRegion\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(r:CellularRegion)\n",
    "        MERGE (n)-[:USE_CASE]->(r)\n",
    "    \"\"\")\n",
    "    ## Software\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(s:Software)\n",
    "        MERGE (n)-[:USE_CASE]->(s)\n",
    "    \"\"\")\n",
    "    ## RegionZone\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(:DataType)-->(s:RegionZone)\n",
    "        MERGE (n)-[:USE_CASE]->(s)\n",
    "    \"\"\")\n",
    "    ## SectioningInstrument\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(s:SectioningInstrument)\n",
    "        MERGE (n)-[:USE_CASE]->(s)\n",
    "    \"\"\")\n",
    "\n",
    "     ## CellType\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(c:CellType)\n",
    "        MERGE (n)-[:USE_CASE]->(c)\n",
    "    \"\"\")\n",
    "    \n",
    "     ## CellType\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:Analysis)-->(c:NeuralStructure)\n",
    "        MERGE (n)-[:USE_CASE]->(c)\n",
    "    \"\"\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now, with the relationships in place, we create a graph projection for each community and run the node similarity algorithm again to see if there are any analyses within a community that is similar"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "created 10 projections\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{134: [['170', '173', 1.0], ['173', '170', 1.0]],\n",
       " 30: [['103', '104', 1.0], ['104', '103', 1.0]],\n",
       " 64: [['165', '533', 1.0], ['533', '165', 1.0]],\n",
       " 330: [['166', '535', 1.0], ['535', '166', 1.0]],\n",
       " 332: [['167', '537', 1.0], ['537', '167', 1.0]],\n",
       " 331: [['168', '536', 1.0], ['536', '168', 1.0]],\n",
       " 329: [['169', '534', 1.0], ['534', '169', 1.0]],\n",
       " 71: [['171', '172', 1.0], ['172', '171', 1.0]],\n",
       " 117: [['250', '251', 1.0], ['251', '250', 1.0]],\n",
       " 121: [['254', '257', 1.0], ['257', '254', 1.0]]}"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_method_similarity(degreeCutoff, simCutoff):\n",
    "    tables = {}\n",
    "    with driver.session() as session:\n",
    "        session.run(\"\"\"\n",
    "            MATCH ()-[r:NODE_ANALYSES_SIMILARITY]-()\n",
    "            DETACH DELETE r\n",
    "        \"\"\")\n",
    "        \n",
    "        # create projection for each community\n",
    "        for row in louvain_table:\n",
    "            \n",
    "            if(row[1] <= 1):\n",
    "                continue\n",
    "            community_id = row[0]\n",
    "            \n",
    "            name = 'analyses-' + str(community_id)\n",
    "            res = session.run(\"\"\"\n",
    "                CALL gds.graph.create.cypher(\n",
    "                    '%s',\n",
    "                    'MATCH (a:Analysis)-[:USE_CASE]->(m) WHERE a.louvainAnalyses = %d WITH collect(a)+collect(m) as nodes UNWIND nodes as x RETURN DISTINCT id(x) as id', \n",
    "                    'MATCH (a:Analysis)-[:USE_CASE]->(m) WHERE a.louvainAnalyses = %d RETURN id(a) as source, id(m) as target'\n",
    "                )\"\"\" % (name, community_id, community_id))\n",
    "\n",
    "            #for rec in res:\n",
    "            #    print(\"Created projection for\", community_id, \"with\", rec[\"nodeCount\"], \"nodes\")\n",
    "\n",
    "            res = session.run(\"\"\"\n",
    "                CALL gds.nodeSimilarity.stream(\n",
    "                    '%s',\n",
    "                    {\n",
    "                        degreeCutoff: %d,\n",
    "                        similarityCutoff: %d\n",
    "                    }\n",
    "                )\n",
    "                YIELD node1, node2, similarity\n",
    "                RETURN gds.util.asNode(node1).id as id1, gds.util.asNode(node2).id as id2, similarity\n",
    "                ORDER BY id1\n",
    "            \"\"\" % (name, degreeCutoff, simCutoff))\n",
    "            \n",
    "            count = 0\n",
    "\n",
    "            \n",
    "            for record in res:\n",
    "                if(count == 0):\n",
    "                    tables[community_id] = []\n",
    "                count+=1\n",
    "                tables[community_id].append([record[\"id1\"], record[\"id2\"], record[\"similarity\"]])\n",
    "\n",
    "            ## Store the NODE_METHOD_SIMILARITY relationship between the analyses within the group:\n",
    "            session.run(\"\"\"\n",
    "                CALL gds.nodeSimilarity.write(\n",
    "                    '%s',\n",
    "                    {\n",
    "                        degreeCutoff: %d,\n",
    "                        similarityCutoff: %d,\n",
    "                        writeRelationshipType: 'NODE_METHOD_SIMILARITY',\n",
    "                        writeProperty:'score'\n",
    "                    }\n",
    "                )\n",
    "            \"\"\" % (name, degreeCutoff, simCutoff))\n",
    "\n",
    "            session.run(\"call gds.graph.drop('%s')\" % name)\n",
    "\n",
    "    print(\"created\", len(tables), \"projections\")\n",
    "    return tables\n",
    "    \n",
    "get_method_similarity(10, 1.0)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Visualized: \n",
    "<img src=\"..\\Data/visualizations/use_case_totally_similar.png\" alt=\"Drawing\" style=\"width: 300px;\"/>\n",
    "\n",
    "By this, we observe that only nodes from the same experiments are completely similar with methods.\n",
    "We can now try to have degree cutoff at 9, to allow one thing to be not common:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "created 27 projections\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{134: [['170', '173', 1.0],\n",
       "  ['170', '363', 0.5384615384615384],\n",
       "  ['170', '362', 0.5],\n",
       "  ['170', '449', 0.42857142857142855],\n",
       "  ['173', '170', 1.0],\n",
       "  ['173', '363', 0.5384615384615384],\n",
       "  ['173', '362', 0.5],\n",
       "  ['173', '449', 0.42857142857142855],\n",
       "  ['362', '363', 0.9],\n",
       "  ['362', '449', 0.5833333333333334],\n",
       "  ['362', '173', 0.5],\n",
       "  ['362', '170', 0.5],\n",
       "  ['363', '362', 0.9],\n",
       "  ['363', '173', 0.5384615384615384],\n",
       "  ['363', '170', 0.5384615384615384],\n",
       "  ['363', '449', 0.5],\n",
       "  ['449', '362', 0.5833333333333334],\n",
       "  ['449', '363', 0.5],\n",
       "  ['449', '173', 0.42857142857142855],\n",
       "  ['449', '170', 0.42857142857142855]],\n",
       " 384: [['643', '644', 0.7647058823529411], ['644', '643', 0.7647058823529411]],\n",
       " 265: [['338', '358', 1.0],\n",
       "  ['338', '346', 1.0],\n",
       "  ['338', '471', 0.8],\n",
       "  ['338', '463', 0.8],\n",
       "  ['338', '453', 0.8],\n",
       "  ['338', '425', 0.8],\n",
       "  ['338', '415', 0.8],\n",
       "  ['338', '481', 0.7272727272727273],\n",
       "  ['338', '493', 0.6363636363636364],\n",
       "  ['346', '358', 1.0],\n",
       "  ['346', '338', 1.0],\n",
       "  ['346', '471', 0.8],\n",
       "  ['346', '463', 0.8],\n",
       "  ['346', '453', 0.8],\n",
       "  ['346', '425', 0.8],\n",
       "  ['346', '415', 0.8],\n",
       "  ['346', '481', 0.7272727272727273],\n",
       "  ['346', '493', 0.6363636363636364],\n",
       "  ['358', '346', 1.0],\n",
       "  ['358', '338', 1.0],\n",
       "  ['358', '471', 0.8],\n",
       "  ['358', '463', 0.8],\n",
       "  ['358', '453', 0.8],\n",
       "  ['358', '425', 0.8],\n",
       "  ['358', '415', 0.8],\n",
       "  ['358', '481', 0.7272727272727273],\n",
       "  ['358', '493', 0.6363636363636364],\n",
       "  ['415', '358', 0.8],\n",
       "  ['415', '425', 0.8],\n",
       "  ['415', '471', 0.8],\n",
       "  ['415', '463', 0.8],\n",
       "  ['415', '346', 0.8],\n",
       "  ['415', '338', 0.8],\n",
       "  ['415', '493', 0.6363636363636364],\n",
       "  ['415', '453', 0.6363636363636364],\n",
       "  ['415', '481', 0.5833333333333334],\n",
       "  ['425', '358', 0.8],\n",
       "  ['425', '415', 0.8],\n",
       "  ['425', '471', 0.8],\n",
       "  ['425', '463', 0.8],\n",
       "  ['425', '346', 0.8],\n",
       "  ['425', '338', 0.8],\n",
       "  ['425', '493', 0.6363636363636364],\n",
       "  ['425', '453', 0.6363636363636364],\n",
       "  ['425', '481', 0.5833333333333334],\n",
       "  ['453', '481', 0.9],\n",
       "  ['453', '358', 0.8],\n",
       "  ['453', '346', 0.8],\n",
       "  ['453', '338', 0.8],\n",
       "  ['453', '463', 0.6363636363636364],\n",
       "  ['453', '493', 0.6363636363636364],\n",
       "  ['453', '471', 0.6363636363636364],\n",
       "  ['453', '425', 0.6363636363636364],\n",
       "  ['453', '415', 0.6363636363636364],\n",
       "  ['463', '358', 0.8],\n",
       "  ['463', '425', 0.8],\n",
       "  ['463', '471', 0.8],\n",
       "  ['463', '415', 0.8],\n",
       "  ['463', '346', 0.8],\n",
       "  ['463', '338', 0.8],\n",
       "  ['463', '493', 0.6363636363636364],\n",
       "  ['463', '453', 0.6363636363636364],\n",
       "  ['463', '481', 0.5833333333333334],\n",
       "  ['471', '358', 0.8],\n",
       "  ['471', '425', 0.8],\n",
       "  ['471', '463', 0.8],\n",
       "  ['471', '493', 0.8],\n",
       "  ['471', '415', 0.8],\n",
       "  ['471', '346', 0.8],\n",
       "  ['471', '338', 0.8],\n",
       "  ['471', '453', 0.6363636363636364],\n",
       "  ['471', '481', 0.5833333333333334],\n",
       "  ['481', '453', 0.9],\n",
       "  ['481', '358', 0.7272727272727273],\n",
       "  ['481', '346', 0.7272727272727273],\n",
       "  ['481', '338', 0.7272727272727273],\n",
       "  ['481', '463', 0.5833333333333334],\n",
       "  ['481', '493', 0.5833333333333334],\n",
       "  ['481', '471', 0.5833333333333334],\n",
       "  ['481', '425', 0.5833333333333334],\n",
       "  ['481', '415', 0.5833333333333334],\n",
       "  ['493', '471', 0.8],\n",
       "  ['493', '358', 0.6363636363636364],\n",
       "  ['493', '425', 0.6363636363636364],\n",
       "  ['493', '463', 0.6363636363636364],\n",
       "  ['493', '453', 0.6363636363636364],\n",
       "  ['493', '415', 0.6363636363636364],\n",
       "  ['493', '346', 0.6363636363636364],\n",
       "  ['493', '338', 0.6363636363636364],\n",
       "  ['493', '481', 0.5833333333333334]],\n",
       " 409: [['180', '543', 0.46153846153846156],\n",
       "  ['180', '650', 0.38461538461538464],\n",
       "  ['543', '180', 0.46153846153846156],\n",
       "  ['543', '650', 0.35714285714285715],\n",
       "  ['650', '180', 0.38461538461538464],\n",
       "  ['650', '543', 0.35714285714285715]],\n",
       " 476: [['182', '729', 0.38461538461538464],\n",
       "  ['182', '728', 0.38461538461538464],\n",
       "  ['728', '729', 1.0],\n",
       "  ['728', '182', 0.38461538461538464],\n",
       "  ['729', '728', 1.0],\n",
       "  ['729', '182', 0.38461538461538464]],\n",
       " 359: [['569', '572', 1.0],\n",
       "  ['569', '574', 1.0],\n",
       "  ['569', '576', 1.0],\n",
       "  ['569', '578', 1.0],\n",
       "  ['569', '577', 1.0],\n",
       "  ['569', '575', 1.0],\n",
       "  ['569', '573', 1.0],\n",
       "  ['569', '571', 1.0],\n",
       "  ['569', '570', 1.0],\n",
       "  ['569', '673', 0.34782608695652173],\n",
       "  ['570', '572', 1.0],\n",
       "  ['570', '574', 1.0],\n",
       "  ['570', '576', 1.0],\n",
       "  ['570', '578', 1.0],\n",
       "  ['570', '577', 1.0],\n",
       "  ['570', '575', 1.0],\n",
       "  ['570', '573', 1.0],\n",
       "  ['570', '571', 1.0],\n",
       "  ['570', '569', 1.0],\n",
       "  ['570', '673', 0.34782608695652173],\n",
       "  ['571', '572', 1.0],\n",
       "  ['571', '574', 1.0],\n",
       "  ['571', '576', 1.0],\n",
       "  ['571', '578', 1.0],\n",
       "  ['571', '577', 1.0],\n",
       "  ['571', '575', 1.0],\n",
       "  ['571', '573', 1.0],\n",
       "  ['571', '570', 1.0],\n",
       "  ['571', '569', 1.0],\n",
       "  ['571', '673', 0.34782608695652173],\n",
       "  ['572', '571', 1.0],\n",
       "  ['572', '574', 1.0],\n",
       "  ['572', '576', 1.0],\n",
       "  ['572', '578', 1.0],\n",
       "  ['572', '577', 1.0],\n",
       "  ['572', '575', 1.0],\n",
       "  ['572', '573', 1.0],\n",
       "  ['572', '570', 1.0],\n",
       "  ['572', '569', 1.0],\n",
       "  ['572', '673', 0.34782608695652173],\n",
       "  ['573', '571', 1.0],\n",
       "  ['573', '574', 1.0],\n",
       "  ['573', '576', 1.0],\n",
       "  ['573', '578', 1.0],\n",
       "  ['573', '577', 1.0],\n",
       "  ['573', '575', 1.0],\n",
       "  ['573', '572', 1.0],\n",
       "  ['573', '570', 1.0],\n",
       "  ['573', '569', 1.0],\n",
       "  ['573', '673', 0.34782608695652173],\n",
       "  ['574', '571', 1.0],\n",
       "  ['574', '573', 1.0],\n",
       "  ['574', '576', 1.0],\n",
       "  ['574', '578', 1.0],\n",
       "  ['574', '577', 1.0],\n",
       "  ['574', '575', 1.0],\n",
       "  ['574', '572', 1.0],\n",
       "  ['574', '570', 1.0],\n",
       "  ['574', '569', 1.0],\n",
       "  ['574', '673', 0.34782608695652173],\n",
       "  ['575', '571', 1.0],\n",
       "  ['575', '573', 1.0],\n",
       "  ['575', '576', 1.0],\n",
       "  ['575', '578', 1.0],\n",
       "  ['575', '577', 1.0],\n",
       "  ['575', '574', 1.0],\n",
       "  ['575', '572', 1.0],\n",
       "  ['575', '570', 1.0],\n",
       "  ['575', '569', 1.0],\n",
       "  ['575', '673', 0.34782608695652173],\n",
       "  ['576', '571', 1.0],\n",
       "  ['576', '573', 1.0],\n",
       "  ['576', '575', 1.0],\n",
       "  ['576', '578', 1.0],\n",
       "  ['576', '577', 1.0],\n",
       "  ['576', '574', 1.0],\n",
       "  ['576', '572', 1.0],\n",
       "  ['576', '570', 1.0],\n",
       "  ['576', '569', 1.0],\n",
       "  ['576', '673', 0.34782608695652173],\n",
       "  ['577', '571', 1.0],\n",
       "  ['577', '573', 1.0],\n",
       "  ['577', '575', 1.0],\n",
       "  ['577', '578', 1.0],\n",
       "  ['577', '576', 1.0],\n",
       "  ['577', '574', 1.0],\n",
       "  ['577', '572', 1.0],\n",
       "  ['577', '570', 1.0],\n",
       "  ['577', '569', 1.0],\n",
       "  ['577', '673', 0.34782608695652173],\n",
       "  ['578', '571', 1.0],\n",
       "  ['578', '573', 1.0],\n",
       "  ['578', '575', 1.0],\n",
       "  ['578', '577', 1.0],\n",
       "  ['578', '576', 1.0],\n",
       "  ['578', '574', 1.0],\n",
       "  ['578', '572', 1.0],\n",
       "  ['578', '570', 1.0],\n",
       "  ['578', '569', 1.0],\n",
       "  ['578', '673', 0.34782608695652173],\n",
       "  ['673', '571', 0.34782608695652173],\n",
       "  ['673', '573', 0.34782608695652173],\n",
       "  ['673', '575', 0.34782608695652173],\n",
       "  ['673', '577', 0.34782608695652173],\n",
       "  ['673', '578', 0.34782608695652173],\n",
       "  ['673', '576', 0.34782608695652173],\n",
       "  ['673', '574', 0.34782608695652173],\n",
       "  ['673', '572', 0.34782608695652173],\n",
       "  ['673', '570', 0.34782608695652173],\n",
       "  ['673', '569', 0.34782608695652173]],\n",
       " 369: [['579', '582', 1.0],\n",
       "  ['579', '584', 1.0],\n",
       "  ['579', '586', 1.0],\n",
       "  ['579', '588', 1.0],\n",
       "  ['579', '587', 1.0],\n",
       "  ['579', '585', 1.0],\n",
       "  ['579', '583', 1.0],\n",
       "  ['579', '581', 1.0],\n",
       "  ['579', '580', 1.0],\n",
       "  ['579', '674', 0.34782608695652173],\n",
       "  ['580', '582', 1.0],\n",
       "  ['580', '584', 1.0],\n",
       "  ['580', '586', 1.0],\n",
       "  ['580', '588', 1.0],\n",
       "  ['580', '587', 1.0],\n",
       "  ['580', '585', 1.0],\n",
       "  ['580', '583', 1.0],\n",
       "  ['580', '581', 1.0],\n",
       "  ['580', '579', 1.0],\n",
       "  ['580', '674', 0.34782608695652173],\n",
       "  ['581', '582', 1.0],\n",
       "  ['581', '584', 1.0],\n",
       "  ['581', '586', 1.0],\n",
       "  ['581', '588', 1.0],\n",
       "  ['581', '587', 1.0],\n",
       "  ['581', '585', 1.0],\n",
       "  ['581', '583', 1.0],\n",
       "  ['581', '580', 1.0],\n",
       "  ['581', '579', 1.0],\n",
       "  ['581', '674', 0.34782608695652173],\n",
       "  ['582', '581', 1.0],\n",
       "  ['582', '584', 1.0],\n",
       "  ['582', '586', 1.0],\n",
       "  ['582', '588', 1.0],\n",
       "  ['582', '587', 1.0],\n",
       "  ['582', '585', 1.0],\n",
       "  ['582', '583', 1.0],\n",
       "  ['582', '580', 1.0],\n",
       "  ['582', '579', 1.0],\n",
       "  ['582', '674', 0.34782608695652173],\n",
       "  ['583', '581', 1.0],\n",
       "  ['583', '584', 1.0],\n",
       "  ['583', '586', 1.0],\n",
       "  ['583', '588', 1.0],\n",
       "  ['583', '587', 1.0],\n",
       "  ['583', '585', 1.0],\n",
       "  ['583', '582', 1.0],\n",
       "  ['583', '580', 1.0],\n",
       "  ['583', '579', 1.0],\n",
       "  ['583', '674', 0.34782608695652173],\n",
       "  ['584', '581', 1.0],\n",
       "  ['584', '583', 1.0],\n",
       "  ['584', '586', 1.0],\n",
       "  ['584', '588', 1.0],\n",
       "  ['584', '587', 1.0],\n",
       "  ['584', '585', 1.0],\n",
       "  ['584', '582', 1.0],\n",
       "  ['584', '580', 1.0],\n",
       "  ['584', '579', 1.0],\n",
       "  ['584', '674', 0.34782608695652173],\n",
       "  ['585', '581', 1.0],\n",
       "  ['585', '583', 1.0],\n",
       "  ['585', '586', 1.0],\n",
       "  ['585', '588', 1.0],\n",
       "  ['585', '587', 1.0],\n",
       "  ['585', '584', 1.0],\n",
       "  ['585', '582', 1.0],\n",
       "  ['585', '580', 1.0],\n",
       "  ['585', '579', 1.0],\n",
       "  ['585', '674', 0.34782608695652173],\n",
       "  ['586', '581', 1.0],\n",
       "  ['586', '583', 1.0],\n",
       "  ['586', '585', 1.0],\n",
       "  ['586', '588', 1.0],\n",
       "  ['586', '587', 1.0],\n",
       "  ['586', '584', 1.0],\n",
       "  ['586', '582', 1.0],\n",
       "  ['586', '580', 1.0],\n",
       "  ['586', '579', 1.0],\n",
       "  ['586', '674', 0.34782608695652173],\n",
       "  ['587', '581', 1.0],\n",
       "  ['587', '583', 1.0],\n",
       "  ['587', '585', 1.0],\n",
       "  ['587', '588', 1.0],\n",
       "  ['587', '586', 1.0],\n",
       "  ['587', '584', 1.0],\n",
       "  ['587', '582', 1.0],\n",
       "  ['587', '580', 1.0],\n",
       "  ['587', '579', 1.0],\n",
       "  ['587', '674', 0.34782608695652173],\n",
       "  ['588', '581', 1.0],\n",
       "  ['588', '583', 1.0],\n",
       "  ['588', '585', 1.0],\n",
       "  ['588', '587', 1.0],\n",
       "  ['588', '586', 1.0],\n",
       "  ['588', '584', 1.0],\n",
       "  ['588', '582', 1.0],\n",
       "  ['588', '580', 1.0],\n",
       "  ['588', '579', 1.0],\n",
       "  ['588', '674', 0.34782608695652173],\n",
       "  ['674', '581', 0.34782608695652173],\n",
       "  ['674', '583', 0.34782608695652173],\n",
       "  ['674', '585', 0.34782608695652173],\n",
       "  ['674', '587', 0.34782608695652173],\n",
       "  ['674', '588', 0.34782608695652173],\n",
       "  ['674', '586', 0.34782608695652173],\n",
       "  ['674', '584', 0.34782608695652173],\n",
       "  ['674', '582', 0.34782608695652173],\n",
       "  ['674', '580', 0.34782608695652173],\n",
       "  ['674', '579', 0.34782608695652173]],\n",
       " 350: [['235', '703', 0.8],\n",
       "  ['235', '704', 0.8],\n",
       "  ['235', '702', 0.8],\n",
       "  ['235', '701', 0.8],\n",
       "  ['701', '703', 1.0],\n",
       "  ['701', '704', 1.0],\n",
       "  ['701', '702', 1.0],\n",
       "  ['701', '235', 0.8],\n",
       "  ['702', '703', 1.0],\n",
       "  ['702', '704', 1.0],\n",
       "  ['702', '701', 1.0],\n",
       "  ['702', '235', 0.8],\n",
       "  ['703', '702', 1.0],\n",
       "  ['703', '704', 1.0],\n",
       "  ['703', '701', 1.0],\n",
       "  ['703', '235', 0.8],\n",
       "  ['704', '702', 1.0],\n",
       "  ['704', '703', 1.0],\n",
       "  ['704', '701', 1.0],\n",
       "  ['704', '235', 0.8]],\n",
       " 155: [['181', '546', 0.46153846153846156],\n",
       "  ['181', '727', 0.38461538461538464],\n",
       "  ['181', '726', 0.38461538461538464],\n",
       "  ['546', '181', 0.46153846153846156],\n",
       "  ['546', '727', 0.35714285714285715],\n",
       "  ['546', '726', 0.35714285714285715],\n",
       "  ['726', '727', 0.8],\n",
       "  ['726', '181', 0.38461538461538464],\n",
       "  ['726', '546', 0.35714285714285715],\n",
       "  ['727', '726', 0.8],\n",
       "  ['727', '181', 0.38461538461538464],\n",
       "  ['727', '546', 0.35714285714285715]],\n",
       " 378: [['639', '642', 1.0], ['642', '639', 1.0]],\n",
       " 30: [['103', '104', 1.0],\n",
       "  ['103', '745', 0.46153846153846156],\n",
       "  ['103', '499', 0.46153846153846156],\n",
       "  ['103', '224', 0.46153846153846156],\n",
       "  ['103', '134', 0.42857142857142855],\n",
       "  ['104', '103', 1.0],\n",
       "  ['104', '745', 0.46153846153846156],\n",
       "  ['104', '499', 0.46153846153846156],\n",
       "  ['104', '224', 0.46153846153846156],\n",
       "  ['104', '134', 0.42857142857142855],\n",
       "  ['134', '745', 0.9],\n",
       "  ['134', '499', 0.7272727272727273],\n",
       "  ['134', '224', 0.5833333333333334],\n",
       "  ['134', '104', 0.42857142857142855],\n",
       "  ['134', '103', 0.42857142857142855],\n",
       "  ['224', '745', 0.6363636363636364],\n",
       "  ['224', '499', 0.6363636363636364],\n",
       "  ['224', '134', 0.5833333333333334],\n",
       "  ['224', '104', 0.46153846153846156],\n",
       "  ['224', '103', 0.46153846153846156],\n",
       "  ['499', '745', 0.8],\n",
       "  ['499', '134', 0.7272727272727273],\n",
       "  ['499', '224', 0.6363636363636364],\n",
       "  ['499', '104', 0.46153846153846156],\n",
       "  ['499', '103', 0.46153846153846156],\n",
       "  ['745', '134', 0.9],\n",
       "  ['745', '499', 0.8],\n",
       "  ['745', '224', 0.6363636363636364],\n",
       "  ['745', '104', 0.46153846153846156],\n",
       "  ['745', '103', 0.46153846153846156]],\n",
       " 81: [['183', '545', 0.5],\n",
       "  ['183', '637', 0.46153846153846156],\n",
       "  ['183', '647', 0.42857142857142855],\n",
       "  ['183', '652', 0.35294117647058826],\n",
       "  ['545', '183', 0.5],\n",
       "  ['545', '637', 0.42857142857142855],\n",
       "  ['545', '647', 0.4],\n",
       "  ['545', '652', 0.3333333333333333],\n",
       "  ['637', '652', 0.4666666666666667],\n",
       "  ['637', '647', 0.46153846153846156],\n",
       "  ['637', '183', 0.46153846153846156],\n",
       "  ['637', '545', 0.42857142857142855],\n",
       "  ['647', '652', 0.5333333333333333],\n",
       "  ['647', '637', 0.46153846153846156],\n",
       "  ['647', '183', 0.42857142857142855],\n",
       "  ['647', '545', 0.4],\n",
       "  ['652', '647', 0.5333333333333333],\n",
       "  ['652', '637', 0.4666666666666667],\n",
       "  ['652', '183', 0.35294117647058826],\n",
       "  ['652', '545', 0.3333333333333333]],\n",
       " 349: [['236', '682', 0.6363636363636364],\n",
       "  ['236', '681', 0.6363636363636364],\n",
       "  ['681', '682', 1.0],\n",
       "  ['681', '236', 0.6363636363636364],\n",
       "  ['682', '681', 1.0],\n",
       "  ['682', '236', 0.6363636363636364]],\n",
       " 355: [['266', '634', 0.6363636363636364], ['634', '266', 0.6363636363636364]],\n",
       " 28: [['101', '102', 1.0],\n",
       "  ['101', '550', 0.8],\n",
       "  ['101', '498', 0.7272727272727273],\n",
       "  ['102', '101', 1.0],\n",
       "  ['102', '550', 0.8],\n",
       "  ['102', '498', 0.7272727272727273],\n",
       "  ['498', '550', 0.7272727272727273],\n",
       "  ['498', '102', 0.7272727272727273],\n",
       "  ['498', '101', 0.7272727272727273],\n",
       "  ['550', '102', 0.8],\n",
       "  ['550', '101', 0.8],\n",
       "  ['550', '498', 0.7272727272727273]],\n",
       " 356: [['635', '744', 0.375], ['744', '635', 0.375]],\n",
       " 335: [['541', '645', 0.35714285714285715],\n",
       "  ['645', '541', 0.35714285714285715]],\n",
       " 64: [['165', '533', 1.0], ['533', '165', 1.0]],\n",
       " 424: [['542', '646', 0.35714285714285715],\n",
       "  ['646', '542', 0.35714285714285715]],\n",
       " 330: [['166', '535', 1.0], ['535', '166', 1.0]],\n",
       " 332: [['167', '537', 1.0], ['537', '167', 1.0]],\n",
       " 331: [['168', '536', 1.0], ['536', '168', 1.0]],\n",
       " 329: [['169', '534', 1.0], ['534', '169', 1.0]],\n",
       " 71: [['171', '172', 1.0], ['172', '171', 1.0]],\n",
       " 385: [['203', '597', 0.46153846153846156],\n",
       "  ['597', '203', 0.46153846153846156]],\n",
       " 117: [['250', '251', 1.0], ['251', '250', 1.0]],\n",
       " 121: [['254', '257', 1.0], ['257', '254', 1.0]]}"
      ]
     },
     "execution_count": 91,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_method_similarity(9, 0.8)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Visualization:\n",
    "\n",
    "<img src=\"..\\Data/visualizations/use_case_9of10_similar.png\" alt=\"Drawing\" style=\"width: 300px;\"/>\n",
    "\n",
    "\n",
    "We still observe that they come from the same experiment.\n",
    "\n",
    "With this we have proven that we *cannot* say anything about the methods used in comparison with the results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    session.run(\"\"\"\n",
    "        MATCH ()-[r:NODE_ANALYSES_SIMILARITY]-()\n",
    "        DETACH DELETE r\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH ()-[r:NODE_METHOD_SIMILARITY]-()\n",
    "        DETACH DELETE r\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH ()-[r:USE_CASE]-()\n",
    "        DETACH DELETE r\n",
    "    \"\"\")\n",
    "    session.run(\"\"\"\n",
    "        MATCH (n:AnalysisDataType)\n",
    "        DETACH DELETE n\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
